[NoCoverage] BlockStatement
src/capacity/application/audit-read.service.ts:114:65
   if (limit === undefined) {
     return fallback;
   }
-  if (!Number.isInteger(limit) || limit < 1 || limit > maximum) {
-    throw new BadRequestException({
-      code: 'VALIDATION_FAILED',
-      message: 'The limit is out of range.',
-    });
-  }
+  if (!Number.isInteger(limit) || limit < 1 || limit > maximum) {}
   return limit;
 }

[NoCoverage] LogicalOperator
src/capacity/application/audit-read.service.ts:114:7
   if (limit === undefined) {
     return fallback;
   }
-  if (!Number.isInteger(limit) || limit < 1 || limit > maximum) {
+  if ((!Number.isInteger(limit) || limit < 1) && limit > maximum) {
     throw new BadRequestException({
       code: 'VALIDATION_FAILED',

[NoCoverage] ArrayDeclaration
src/capacity/application/audit-read.service.ts:162:34
     );
 
     const parameters: unknown[] = [programId];
-    const conditions: string[] = ['program_id = $1'];
+    const conditions: string[] = [];
 
     if (query.status !== undefined) {

[NoCoverage] StringLiteral
src/capacity/application/audit-read.service.ts:162:35
     );
 
     const parameters: unknown[] = [programId];
-    const conditions: string[] = ['program_id = $1'];
+    const conditions: string[] = [""];
 
     if (query.status !== undefined) {

[NoCoverage] ConditionalExpression
src/capacity/application/audit-read.service.ts:164:9
     const parameters: unknown[] = [programId];
     const conditions: string[] = ['program_id = $1'];
 
-    if (query.status !== undefined) {
+    if (true) {
       parameters.push(query.status);
       conditions.push(`status = $${parameters.length}`);

[NoCoverage] BlockStatement
src/capacity/application/audit-read.service.ts:164:37
     const parameters: unknown[] = [programId];
     const conditions: string[] = ['program_id = $1'];
 
-    if (query.status !== undefined) {
-      parameters.push(query.status);
-      conditions.push(`status = $${parameters.length}`);
-    }
+    if (query.status !== undefined) {}
 
     if (query.cursor !== undefined) {

[NoCoverage] CallExpression
src/capacity/application/audit-read.service.ts:165:7
     const conditions: string[] = ['program_id = $1'];
 
     if (query.status !== undefined) {
-      parameters.push(query.status);
+      ;
       conditions.push(`status = $${parameters.length}`);
     }

[NoCoverage] BlockStatement
src/capacity/application/audit-read.service.ts:169:37
       conditions.push(`status = $${parameters.length}`);
     }
 
-    if (query.cursor !== undefined) {
-      const cursor = decodeCursor<ReservationCursor>(query.cursor);
-      parameters.push(cursor.createdAt, cursor.id);
-      conditions.push(
-        `(created_at, id) < ($${parameters.length - 1}::timestamptz, $${parameters.length}::uuid)`,
-      );
-    }
+    if (query.cursor !== undefined) {}
 
     parameters.push(limit + 1);

[NoCoverage] CallExpression
src/capacity/application/audit-read.service.ts:171:7
 
     if (query.cursor !== undefined) {
       const cursor = decodeCursor<ReservationCursor>(query.cursor);
-      parameters.push(cursor.createdAt, cursor.id);
+      ;
       conditions.push(
         `(created_at, id) < ($${parameters.length - 1}::timestamptz, $${parameters.length}::uuid)`,

[NoCoverage] ArithmeticOperator
src/capacity/application/audit-read.service.ts:173:33
       const cursor = decodeCursor<ReservationCursor>(query.cursor);
       parameters.push(cursor.createdAt, cursor.id);
       conditions.push(
-        `(created_at, id) < ($${parameters.length - 1}::timestamptz, $${parameters.length}::uuid)`,
+        `(created_at, id) < ($${parameters.length + 1}::timestamptz, $${parameters.length}::uuid)`,
       );
     }

[NoCoverage] ArithmeticOperator
src/capacity/application/audit-read.service.ts:177:21
       );
     }
 
-    parameters.push(limit + 1);
+    parameters.push(limit - 1);
     const rows = await this.dataSource.query<InvoiceReservationRow[]>(
       `SELECT *,

[NoCoverage] EqualityOperator
src/capacity/application/audit-read.service.ts:188:21
       parameters,
     );
 
-    const hasMore = rows.length > limit;
+    const hasMore = rows.length <= limit;
     const page = hasMore ? rows.slice(0, limit) : rows;
     const last = page[page.length - 1];

[NoCoverage] EqualityOperator
src/capacity/application/audit-read.service.ts:188:21
       parameters,
     );
 
-    const hasMore = rows.length > limit;
+    const hasMore = rows.length >= limit;
     const page = hasMore ? rows.slice(0, limit) : rows;
     const last = page[page.length - 1];

[NoCoverage] MethodExpression
src/capacity/application/audit-read.service.ts:189:28
     );
 
     const hasMore = rows.length > limit;
-    const page = hasMore ? rows.slice(0, limit) : rows;
+    const page = hasMore ? rows : rows;
     const last = page[page.length - 1];
 

[NoCoverage] ArithmeticOperator
src/capacity/application/audit-read.service.ts:190:23
 
     const hasMore = rows.length > limit;
     const page = hasMore ? rows.slice(0, limit) : rows;
-    const last = page[page.length - 1];
+    const last = page[page.length + 1];
 
     return {

[NoCoverage] BlockStatement
src/capacity/application/audit-read.service.ts:237:35
     const parameters: unknown[] = [programId];
     const conditions: string[] = ['program_id = $1'];
 
-    if (query.from !== undefined) {
-      parameters.push(query.from);
-      conditions.push(`occurred_at >= $${parameters.length}::timestamptz`);
-    }
+    if (query.from !== undefined) {}
     if (query.to !== undefined) {
       parameters.push(query.to);

[NoCoverage] ConditionalExpression
src/capacity/application/audit-read.service.ts:237:9
     const parameters: unknown[] = [programId];
     const conditions: string[] = ['program_id = $1'];
 
-    if (query.from !== undefined) {
+    if (false) {
       parameters.push(query.from);
       conditions.push(`occurred_at >= $${parameters.length}::timestamptz`);

[NoCoverage] CallExpression
src/capacity/application/audit-read.service.ts:238:7
     const conditions: string[] = ['program_id = $1'];
 
     if (query.from !== undefined) {
-      parameters.push(query.from);
+      ;
       conditions.push(`occurred_at >= $${parameters.length}::timestamptz`);
     }

[NoCoverage] EqualityOperator
src/capacity/application/audit-read.service.ts:241:9
       parameters.push(query.from);
       conditions.push(`occurred_at >= $${parameters.length}::timestamptz`);
     }
-    if (query.to !== undefined) {
+    if (query.to === undefined) {
       parameters.push(query.to);
       conditions.push(`occurred_at <= $${parameters.length}::timestamptz`);

[NoCoverage] BlockStatement
src/capacity/application/audit-read.service.ts:241:33
       parameters.push(query.from);
       conditions.push(`occurred_at >= $${parameters.length}::timestamptz`);
     }
-    if (query.to !== undefined) {
-      parameters.push(query.to);
-      conditions.push(`occurred_at <= $${parameters.length}::timestamptz`);
-    }
+    if (query.to !== undefined) {}
     if (query.cause !== undefined) {
       parameters.push(query.cause);

[NoCoverage] CallExpression
src/capacity/application/audit-read.service.ts:242:7
       conditions.push(`occurred_at >= $${parameters.length}::timestamptz`);
     }
     if (query.to !== undefined) {
-      parameters.push(query.to);
+      ;
       conditions.push(`occurred_at <= $${parameters.length}::timestamptz`);
     }

[NoCoverage] BlockStatement
src/capacity/application/audit-read.service.ts:245:36
       parameters.push(query.to);
       conditions.push(`occurred_at <= $${parameters.length}::timestamptz`);
     }
-    if (query.cause !== undefined) {
-      parameters.push(query.cause);
-      conditions.push(`cause = $${parameters.length}`);
-    }
+    if (query.cause !== undefined) {}
     if (query.cursor !== undefined) {
       const cursor = decodeCursor<LedgerCursor>(query.cursor);

[NoCoverage] ConditionalExpression
src/capacity/application/audit-read.service.ts:245:9
       parameters.push(query.to);
       conditions.push(`occurred_at <= $${parameters.length}::timestamptz`);
     }
-    if (query.cause !== undefined) {
+    if (false) {
       parameters.push(query.cause);
       conditions.push(`cause = $${parameters.length}`);

[NoCoverage] CallExpression
src/capacity/application/audit-read.service.ts:246:7
       conditions.push(`occurred_at <= $${parameters.length}::timestamptz`);
     }
     if (query.cause !== undefined) {
-      parameters.push(query.cause);
+      ;
       conditions.push(`cause = $${parameters.length}`);
     }

[NoCoverage] BlockStatement
src/capacity/application/audit-read.service.ts:249:37
       parameters.push(query.cause);
       conditions.push(`cause = $${parameters.length}`);
     }
-    if (query.cursor !== undefined) {
-      const cursor = decodeCursor<LedgerCursor>(query.cursor);
-      parameters.push(cursor.sequence);
-      conditions.push(`sequence < $${parameters.length}::bigint`);
-    }
+    if (query.cursor !== undefined) {}
 
     parameters.push(limit + 1);

[NoCoverage] CallExpression
src/capacity/application/audit-read.service.ts:251:7
     }
     if (query.cursor !== undefined) {
       const cursor = decodeCursor<LedgerCursor>(query.cursor);
-      parameters.push(cursor.sequence);
+      ;
       conditions.push(`sequence < $${parameters.length}::bigint`);
     }

[NoCoverage] StringLiteral
src/capacity/application/audit-read.service.ts:259:33
     const rows = await this.dataSource.query<LedgerEntryRow[]>(
       `SELECT *
          FROM capacity_ledger_entry
-        WHERE ${conditions.join(' AND ')}
+        WHERE ${conditions.join("")}
         ORDER BY sequence DESC
         LIMIT $${parameters.length}`,
