[NoCoverage] StringLiteral
src/capacity/application/apply-snapshot.service.ts:62:21
   snapshot: ReconciliationSnapshot,
 ): string {
   const acknowledgement = snapshot.acknowledgement;
-  return createHash('sha256')
+  return createHash("")
     .update(
       JSON.stringify({

[NoCoverage] ObjectLiteral
src/capacity/application/apply-snapshot.service.ts:72:15
         acknowledgement:
           acknowledgement === null
             ? null
-            : {
-                kind: acknowledgement.kind,
-                reservationReferences: acknowledgement.reservationReferences,
-                ingestedThrough:
-                  acknowledgement.ingestedThrough?.toISOString() ?? null,
-              },
+            : {},
       }),
     )

[NoCoverage] LogicalOperator
src/capacity/application/apply-snapshot.service.ts:76:19
                 kind: acknowledgement.kind,
                 reservationReferences: acknowledgement.reservationReferences,
                 ingestedThrough:
-                  acknowledgement.ingestedThrough?.toISOString() ?? null,
+                  acknowledgement.ingestedThrough?.toISOString() && null,
               },
       }),

[NoCoverage] EqualityOperator
src/capacity/application/apply-snapshot.service.ts:101:9
       `SELECT message_id FROM processed_message WHERE message_id = $1`,
       [snapshot.messageId],
     );
-    if (byId.length > 0) return { kind: 'ignored' };
+    if (byId.length <= 0) return { kind: 'ignored' };
 
     const program = await this.programRepository.findById(

[NoCoverage] ConditionalExpression
src/capacity/application/apply-snapshot.service.ts:101:9
       `SELECT message_id FROM processed_message WHERE message_id = $1`,
       [snapshot.messageId],
     );
-    if (byId.length > 0) return { kind: 'ignored' };
+    if (false) return { kind: 'ignored' };
 
     const program = await this.programRepository.findById(

[NoCoverage] EqualityOperator
src/capacity/application/apply-snapshot.service.ts:108:9
       snapshot.programId,
     );
     if (program === null) return { kind: 'quarantined', reason: 'UNKNOWN_PROGRAM' };
-    if (program.currency !== snapshot.currency) {
+    if (program.currency === snapshot.currency) {
       return { kind: 'quarantined', reason: 'CURRENCY_MISMATCH' };
     }

[NoCoverage] ConditionalExpression
src/capacity/application/apply-snapshot.service.ts:108:9
       snapshot.programId,
     );
     if (program === null) return { kind: 'quarantined', reason: 'UNKNOWN_PROGRAM' };
-    if (program.currency !== snapshot.currency) {
+    if (false) {
       return { kind: 'quarantined', reason: 'CURRENCY_MISMATCH' };
     }

[NoCoverage] EqualityOperator
src/capacity/application/apply-snapshot.service.ts:114:9
 
     // FR-012: a snapshot older than the applied version asserts superseded
     // state and carries no information.
-    if (snapshot.version < program.treasuryVersion) {
+    if (snapshot.version >= program.treasuryVersion) {
       return { kind: 'ignored' };
     }

[NoCoverage] EqualityOperator
src/capacity/application/apply-snapshot.service.ts:114:9
 
     // FR-012: a snapshot older than the applied version asserts superseded
     // state and carries no information.
-    if (snapshot.version < program.treasuryVersion) {
+    if (snapshot.version <= program.treasuryVersion) {
       return { kind: 'ignored' };
     }

[NoCoverage] EqualityOperator
src/capacity/application/apply-snapshot.service.ts:119:9
     }
 
     // FR-013b: same (program, kind, version), different content -> conflict.
-    if (snapshot.version === program.treasuryVersion) {
+    if (snapshot.version !== program.treasuryVersion) {
       const sameVersion = await this.dataSource.query<ContentHashRow[]>(
         `SELECT content_hash FROM processed_message

[NoCoverage] BlockStatement
src/capacity/application/apply-snapshot.service.ts:119:55
     }
 
     // FR-013b: same (program, kind, version), different content -> conflict.
-    if (snapshot.version === program.treasuryVersion) {
-      const sameVersion = await this.dataSource.query<ContentHashRow[]>(
-        `SELECT content_hash FROM processed_message
-          WHERE program_id = $1 AND kind = 'SNAPSHOT' AND version = $2`,
-        [snapshot.programId, snapshot.version.toString()],
-      );
-      const existing = sameVersion[0];
-      if (existing !== undefined) {
-        return existing.content_hash === reconciliationSnapshotContentHash(snapshot)
-          ? { kind: 'ignored' }
-          : { kind: 'quarantined', reason: 'VERSION_CONFLICT' };
-      }
-    }
+    if (snapshot.version === program.treasuryVersion) {}
 
     return { kind: 'proceed' };

[NoCoverage] BlockStatement
src/capacity/application/apply-snapshot.service.ts:126:35
         [snapshot.programId, snapshot.version.toString()],
       );
       const existing = sameVersion[0];
-      if (existing !== undefined) {
-        return existing.content_hash === reconciliationSnapshotContentHash(snapshot)
-          ? { kind: 'ignored' }
-          : { kind: 'quarantined', reason: 'VERSION_CONFLICT' };
-      }
+      if (existing !== undefined) {}
     }
 

[NoCoverage] EqualityOperator
src/capacity/application/apply-snapshot.service.ts:127:16
       );
       const existing = sameVersion[0];
       if (existing !== undefined) {
-        return existing.content_hash === reconciliationSnapshotContentHash(snapshot)
+        return existing.content_hash !== reconciliationSnapshotContentHash(snapshot)
           ? { kind: 'ignored' }
           : { kind: 'quarantined', reason: 'VERSION_CONFLICT' };

[NoCoverage] ConditionalExpression
src/capacity/application/apply-snapshot.service.ts:127:16
       );
       const existing = sameVersion[0];
       if (existing !== undefined) {
-        return existing.content_hash === reconciliationSnapshotContentHash(snapshot)
+        return false
           ? { kind: 'ignored' }
           : { kind: 'quarantined', reason: 'VERSION_CONFLICT' };

[NoCoverage] EqualityOperator
src/capacity/application/apply-snapshot.service.ts:149:15
       return await this.unitOfWork.withProgramLock(
         snapshot.programId,
         async ({ manager, program }): Promise<SnapshotApplyOutcome> => {
-          if (program.currency !== snapshot.currency) {
+          if (program.currency === snapshot.currency) {
             return { kind: 'quarantined', reason: 'CURRENCY_MISMATCH' } as const;
           }

[NoCoverage] ConditionalExpression
src/capacity/application/apply-snapshot.service.ts:149:15
       return await this.unitOfWork.withProgramLock(
         snapshot.programId,
         async ({ manager, program }): Promise<SnapshotApplyOutcome> => {
-          if (program.currency !== snapshot.currency) {
+          if (false) {
             return { kind: 'quarantined', reason: 'CURRENCY_MISMATCH' } as const;
           }

[NoCoverage] StringLiteral
src/capacity/application/apply-snapshot.service.ts:156:13
           // Identity, version and staleness are re-checked under the program
           // lock: `inspect` is a read that can race a concurrent apply.
           const byId = await manager.query<ProcessedMessageRow[]>(
-            `SELECT message_id, content_hash FROM processed_message WHERE message_id = $1`,
+            ``,
             [snapshot.messageId],
           );

[NoCoverage] ConditionalExpression
src/capacity/application/apply-snapshot.service.ts:159:15
             `SELECT message_id, content_hash FROM processed_message WHERE message_id = $1`,
             [snapshot.messageId],
           );
-          if (byId.length > 0) return { kind: 'ignored' } as const;
+          if (false) return { kind: 'ignored' } as const;
 
           const contentHash = reconciliationSnapshotContentHash(snapshot);

[NoCoverage] EqualityOperator
src/capacity/application/apply-snapshot.service.ts:159:15
             `SELECT message_id, content_hash FROM processed_message WHERE message_id = $1`,
             [snapshot.messageId],
           );
-          if (byId.length > 0) return { kind: 'ignored' } as const;
+          if (byId.length >= 0) return { kind: 'ignored' } as const;
 
           const contentHash = reconciliationSnapshotContentHash(snapshot);

[NoCoverage] StringLiteral
src/capacity/application/apply-snapshot.service.ts:163:13
 
           const contentHash = reconciliationSnapshotContentHash(snapshot);
           const sameVersion = await manager.query<ProcessedMessageRow[]>(
-            `SELECT message_id, content_hash FROM processed_message
-              WHERE program_id = $1 AND kind = 'SNAPSHOT' AND version = $2`,
+            ``,
             [snapshot.programId, snapshot.version.toString()],
           );

[NoCoverage] BlockStatement
src/capacity/application/apply-snapshot.service.ts:168:39
             [snapshot.programId, snapshot.version.toString()],
           );
           const existing = sameVersion[0];
-          if (existing !== undefined) {
-            if (existing.message_id === snapshot.messageId) {
-              return { kind: 'ignored' } as const;
-            }
-            return existing.content_hash === contentHash
-              ? ({ kind: 'ignored' } as const)
-              : ({ kind: 'quarantined', reason: 'VERSION_CONFLICT' } as const);
-          }
+          if (existing !== undefined) {}
 
           if (snapshot.version < program.treasuryVersion) {

[NoCoverage] BlockStatement
src/capacity/application/apply-snapshot.service.ts:169:61
           );
           const existing = sameVersion[0];
           if (existing !== undefined) {
-            if (existing.message_id === snapshot.messageId) {
-              return { kind: 'ignored' } as const;
-            }
+            if (existing.message_id === snapshot.messageId) {}
             return existing.content_hash === contentHash
               ? ({ kind: 'ignored' } as const)

[NoCoverage] ConditionalExpression
src/capacity/application/apply-snapshot.service.ts:169:17
           );
           const existing = sameVersion[0];
           if (existing !== undefined) {
-            if (existing.message_id === snapshot.messageId) {
+            if (false) {
               return { kind: 'ignored' } as const;
             }

[NoCoverage] ConditionalExpression
src/capacity/application/apply-snapshot.service.ts:172:20
             if (existing.message_id === snapshot.messageId) {
               return { kind: 'ignored' } as const;
             }
-            return existing.content_hash === contentHash
+            return true
               ? ({ kind: 'ignored' } as const)
               : ({ kind: 'quarantined', reason: 'VERSION_CONFLICT' } as const);

[NoCoverage] ConditionalExpression
src/capacity/application/apply-snapshot.service.ts:172:20
             if (existing.message_id === snapshot.messageId) {
               return { kind: 'ignored' } as const;
             }
-            return existing.content_hash === contentHash
+            return false
               ? ({ kind: 'ignored' } as const)
               : ({ kind: 'quarantined', reason: 'VERSION_CONFLICT' } as const);

[NoCoverage] EqualityOperator
src/capacity/application/apply-snapshot.service.ts:177:15
               : ({ kind: 'quarantined', reason: 'VERSION_CONFLICT' } as const);
           }
 
-          if (snapshot.version < program.treasuryVersion) {
+          if (snapshot.version >= program.treasuryVersion) {
             return { kind: 'ignored' } as const;
           }

[NoCoverage] EqualityOperator
src/capacity/application/apply-snapshot.service.ts:177:15
               : ({ kind: 'quarantined', reason: 'VERSION_CONFLICT' } as const);
           }
 
-          if (snapshot.version < program.treasuryVersion) {
+          if (snapshot.version <= program.treasuryVersion) {
             return { kind: 'ignored' } as const;
           }

[NoCoverage] ConditionalExpression
src/capacity/application/apply-snapshot.service.ts:209:13
           // investigation_required and delta_limit is treasury's own assertion,
           // so neither is a "treasury correction" the guard governs.
           if (
-            this.exceedsMagnitudeGuard(
-              decision.deltas.treasury,
-              program.creditLimitMinor,
-            )
+            false
           ) {
             return { kind: 'quarantined', reason: 'IMPLAUSIBLE_DELTA' } as const;

[NoCoverage] BlockStatement
src/capacity/application/apply-snapshot.service.ts:213:13
               decision.deltas.treasury,
               program.creditLimitMinor,
             )
-          ) {
-            return { kind: 'quarantined', reason: 'IMPLAUSIBLE_DELTA' } as const;
-          }
+          ) {}
 
           const now = new Date();

[NoCoverage] StringLiteral
src/capacity/application/apply-snapshot.service.ts:264:13
           // the recovery flag set by FR-019e. Stale/ignored/quarantined
           // snapshots return before this write and never clear it.
           await manager.query(
-            `UPDATE program
-                SET treasury_version = $2,
-                    treasury_effective_at = $3,
-                    treasury_applied_effective_at =
-                      GREATEST(COALESCE(treasury_applied_effective_at, $3), $3),
-                    investigation_required = investigation_required OR $4,
-                    position_verified = TRUE
-              WHERE id = $1`,
+            ``,
             [
               snapshot.programId,

[NoCoverage] ConditionalExpression
src/capacity/application/apply-snapshot.service.ts:295:15
             ],
           );
 
-          if (decision.acknowledgedReservationIds.length > 0) {
+          if (true) {
             await manager.query(
               `UPDATE invoice_reservation

[NoCoverage] EqualityOperator
src/capacity/application/apply-snapshot.service.ts:295:15
             ],
           );
 
-          if (decision.acknowledgedReservationIds.length > 0) {
+          if (decision.acknowledgedReservationIds.length <= 0) {
             await manager.query(
               `UPDATE invoice_reservation

[NoCoverage] ArrayDeclaration
src/capacity/application/apply-snapshot.service.ts:302:15
                       acknowledged_by_version = $3,
                       updated_at = $4
                 WHERE program_id = $1 AND id = ANY($2::uuid[])`,
-              [
-                snapshot.programId,
-                decision.acknowledgedReservationIds,
-                snapshot.version.toString(),
-                now,
-              ],
+              [],
             );
           }

[NoCoverage] BlockStatement
src/capacity/application/apply-snapshot.service.ts:322:50
         },
       );
     } catch (error) {
-      if (error instanceof ProgramNotFoundError) {
-        return { kind: 'quarantined', reason: 'UNKNOWN_PROGRAM' };
-      }
+      if (error instanceof ProgramNotFoundError) {}
       throw error;
     }

[NoCoverage] ConditionalExpression
src/capacity/application/apply-snapshot.service.ts:322:11
         },
       );
     } catch (error) {
-      if (error instanceof ProgramNotFoundError) {
+      if (true) {
         return { kind: 'quarantined', reason: 'UNKNOWN_PROGRAM' };
       }

[NoCoverage] StringLiteral
src/capacity/application/apply-snapshot.service.ts:358:19
     deltas: SnapshotDeltas,
     snapshot: ReconciliationSnapshot,
   ): PendingLedgerEntry[] {
-    const actor = 'treasury';
+    const actor = "";
     const correlationId = snapshot.correlationId ?? snapshot.messageId;
     const entries: PendingLedgerEntry[] = [];

[NoCoverage] BlockStatement
src/capacity/application/apply-snapshot.service.ts:361:78
     const actor = 'treasury';
     const correlationId = snapshot.correlationId ?? snapshot.messageId;
     const entries: PendingLedgerEntry[] = [];
-    const push = (component: PositionComponent, deltaMinor: bigint): void => {
-      // One entry per non-zero component delta; none for a zero delta (FR-011f).
-      if (deltaMinor === 0n) return;
-      entries.push({
-        deltaMinor,
-        component,
-        cause: 'RECONCILIATION_ADJUSTMENT',
-        originReference: snapshot.messageId,
-        actor,
-        correlationId,
-      });
-    };
+    const push = (component: PositionComponent, deltaMinor: bigint): void => {};
     push('TREASURY', deltas.treasury);
     push('LOCAL', deltas.local);

[NoCoverage] ConditionalExpression
src/capacity/application/apply-snapshot.service.ts:363:11
     const entries: PendingLedgerEntry[] = [];
     const push = (component: PositionComponent, deltaMinor: bigint): void => {
       // One entry per non-zero component delta; none for a zero delta (FR-011f).
-      if (deltaMinor === 0n) return;
+      if (false) return;
       entries.push({
         deltaMinor,

[NoCoverage] ConditionalExpression
src/capacity/application/apply-snapshot.service.ts:363:11
     const entries: PendingLedgerEntry[] = [];
     const push = (component: PositionComponent, deltaMinor: bigint): void => {
       // One entry per non-zero component delta; none for a zero delta (FR-011f).
-      if (deltaMinor === 0n) return;
+      if (true) return;
       entries.push({
         deltaMinor,

[Killed] ArithmeticOperator
src/capacity/application/apply-snapshot.service.ts:391:43
     // through `Number(creditLimitMinor)` loses precision above 2^53. A ratio
     // such as 0.33333 rounds to 3333 basis points, a deliberate quantisation to
     // four decimal places of an operator-chosen heuristic.
-    const basisPoints = BigInt(Math.round(ratio * 10_000));
+    const basisPoints = BigInt(Math.round(ratio / 10_000));
     const magnitude = deltaTreasury < 0n ? -deltaTreasury : deltaTreasury;
     const exceedsGuard = magnitude * 10_000n > basisPoints * creditLimitMinor;
killedBy: ApplySnapshotService.exceedsMagnitudeGuard admits a treasury delta exactly at the guard ratio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/capacity/application/apply-snapshot.service.ts:392:23
     // such as 0.33333 rounds to 3333 basis points, a deliberate quantisation to
     // four decimal places of an operator-chosen heuristic.
     const basisPoints = BigInt(Math.round(ratio * 10_000));
-    const magnitude = deltaTreasury < 0n ? -deltaTreasury : deltaTreasury;
+    const magnitude = true ? -deltaTreasury : deltaTreasury;
     const exceedsGuard = magnitude * 10_000n > basisPoints * creditLimitMinor;
     return exceedsGuard;
killedBy: ApplySnapshotService.exceedsMagnitudeGuard quarantines a treasury delta above the guard ratio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/capacity/application/apply-snapshot.service.ts:392:23
     // such as 0.33333 rounds to 3333 basis points, a deliberate quantisation to
     // four decimal places of an operator-chosen heuristic.
     const basisPoints = BigInt(Math.round(ratio * 10_000));
-    const magnitude = deltaTreasury < 0n ? -deltaTreasury : deltaTreasury;
+    const magnitude = deltaTreasury >= 0n ? -deltaTreasury : deltaTreasury;
     const exceedsGuard = magnitude * 10_000n > basisPoints * creditLimitMinor;
     return exceedsGuard;
killedBy: ApplySnapshotService.exceedsMagnitudeGuard quarantines a treasury delta above the guard ratio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/capacity/application/apply-snapshot.service.ts:393:26
     // four decimal places of an operator-chosen heuristic.
     const basisPoints = BigInt(Math.round(ratio * 10_000));
     const magnitude = deltaTreasury < 0n ? -deltaTreasury : deltaTreasury;
-    const exceedsGuard = magnitude * 10_000n > basisPoints * creditLimitMinor;
+    const exceedsGuard = magnitude / 10_000n > basisPoints * creditLimitMinor;
     return exceedsGuard;
   }
killedBy: ApplySnapshotService.exceedsMagnitudeGuard quarantines a treasury delta above the guard ratio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/capacity/application/apply-snapshot.service.ts:393:26
     // four decimal places of an operator-chosen heuristic.
     const basisPoints = BigInt(Math.round(ratio * 10_000));
     const magnitude = deltaTreasury < 0n ? -deltaTreasury : deltaTreasury;
-    const exceedsGuard = magnitude * 10_000n > basisPoints * creditLimitMinor;
+    const exceedsGuard = true;
     return exceedsGuard;
   }
killedBy: ApplySnapshotService.exceedsMagnitudeGuard admits a treasury delta exactly at the guard ratio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
