[NoCoverage] StringLiteral
src/capacity/application/apply-treasury-event.service.ts:33:21
 
 /** Stable SHA-256 over the fields that determine an event's effect (FR-013b). */
 export function capacityEventContentHash(event: CapacityEvent): string {
-  return createHash('sha256')
+  return createHash("")
     .update(
       JSON.stringify({

[NoCoverage] EqualityOperator
src/capacity/application/apply-treasury-event.service.ts:60:9
       `SELECT message_id FROM processed_message WHERE message_id = $1`,
       [event.messageId],
     );
-    if (byId.length > 0) return { kind: 'already_applied' };
+    if (byId.length >= 0) return { kind: 'already_applied' };
 
     const program = await this.programRepository.findById(

[NoCoverage] EqualityOperator
src/capacity/application/apply-treasury-event.service.ts:60:9
       `SELECT message_id FROM processed_message WHERE message_id = $1`,
       [event.messageId],
     );
-    if (byId.length > 0) return { kind: 'already_applied' };
+    if (byId.length <= 0) return { kind: 'already_applied' };
 
     const program = await this.programRepository.findById(

[NoCoverage] BlockStatement
src/capacity/application/apply-treasury-event.service.ts:67:54
       event.programId,
     );
     if (program === null) return { kind: 'quarantined', reason: 'UNKNOWN_PROGRAM' };
-    if (program.currency !== event.payload.currency) {
-      return { kind: 'quarantined', reason: 'CURRENCY_MISMATCH' };
-    }
+    if (program.currency !== event.payload.currency) {}
 
     // FR-013b: same (program, kind, version), different content -> VERSION_CONFLICT.

[NoCoverage] EqualityOperator
src/capacity/application/apply-treasury-event.service.ts:67:9
       event.programId,
     );
     if (program === null) return { kind: 'quarantined', reason: 'UNKNOWN_PROGRAM' };
-    if (program.currency !== event.payload.currency) {
+    if (program.currency === event.payload.currency) {
       return { kind: 'quarantined', reason: 'CURRENCY_MISMATCH' };
     }

[NoCoverage] BlockStatement
src/capacity/application/apply-treasury-event.service.ts:78:33
       [event.programId, event.version.toString()],
     );
     const existing = sameVersion[0];
-    if (existing !== undefined) {
-      return existing.content_hash === capacityEventContentHash(event)
-        ? { kind: 'already_applied' }
-        : { kind: 'quarantined', reason: 'VERSION_CONFLICT' };
-    }
+    if (existing !== undefined) {}
 
     return { kind: 'proceed' };

[NoCoverage] ConditionalExpression
src/capacity/application/apply-treasury-event.service.ts:79:14
     );
     const existing = sameVersion[0];
     if (existing !== undefined) {
-      return existing.content_hash === capacityEventContentHash(event)
+      return false
         ? { kind: 'already_applied' }
         : { kind: 'quarantined', reason: 'VERSION_CONFLICT' };

[NoCoverage] ConditionalExpression
src/capacity/application/apply-treasury-event.service.ts:79:14
     );
     const existing = sameVersion[0];
     if (existing !== undefined) {
-      return existing.content_hash === capacityEventContentHash(event)
+      return true
         ? { kind: 'already_applied' }
         : { kind: 'quarantined', reason: 'VERSION_CONFLICT' };

[NoCoverage] ConditionalExpression
src/capacity/application/apply-treasury-event.service.ts:93:13
   ): Promise<ApplyOutcome> {
     try {
       return await this.unitOfWork.withProgramLock(event.programId, async ({ manager, program }) => {
-        if (program.currency !== event.payload.currency) {
+        if (false) {
           return { kind: 'quarantined', reason: 'CURRENCY_MISMATCH' } as const;
         }

[NoCoverage] EqualityOperator
src/capacity/application/apply-treasury-event.service.ts:93:13
   ): Promise<ApplyOutcome> {
     try {
       return await this.unitOfWork.withProgramLock(event.programId, async ({ manager, program }) => {
-        if (program.currency !== event.payload.currency) {
+        if (program.currency === event.payload.currency) {
           return { kind: 'quarantined', reason: 'CURRENCY_MISMATCH' } as const;
         }

[NoCoverage] ArrayDeclaration
src/capacity/application/apply-treasury-event.service.ts:110:11
         >(
           `SELECT message_id, content_hash FROM processed_message
             WHERE program_id = $1 AND kind = 'EVENT' AND version = $2`,
-          [event.programId, event.version.toString()],
+          [],
         );
         const existing = sameVersion[0];

[NoCoverage] BlockStatement
src/capacity/application/apply-treasury-event.service.ts:113:37
           [event.programId, event.version.toString()],
         );
         const existing = sameVersion[0];
-        if (existing !== undefined) {
-          if (existing.message_id === event.messageId) {
-            return { kind: 'already_applied' } as const;
-          }
-          return existing.content_hash === contentHash
-            ? ({ kind: 'already_applied' } as const)
-            : ({ kind: 'quarantined', reason: 'VERSION_CONFLICT' } as const);
-        }
+        if (existing !== undefined) {}
 
         // Offset commit follows the DB commit (Key Decision 1): the

[NoCoverage] EqualityOperator
src/capacity/application/apply-treasury-event.service.ts:114:15
         );
         const existing = sameVersion[0];
         if (existing !== undefined) {
-          if (existing.message_id === event.messageId) {
+          if (existing.message_id !== event.messageId) {
             return { kind: 'already_applied' } as const;
           }

[NoCoverage] ConditionalExpression
src/capacity/application/apply-treasury-event.service.ts:114:15
         );
         const existing = sameVersion[0];
         if (existing !== undefined) {
-          if (existing.message_id === event.messageId) {
+          if (false) {
             return { kind: 'already_applied' } as const;
           }

[NoCoverage] ArrayDeclaration
src/capacity/application/apply-treasury-event.service.ts:131:11
            VALUES ($1, $2, 'EVENT', $3, $4, $5)
            ON CONFLICT (message_id) DO NOTHING
            RETURNING message_id`,
-          [
-            event.messageId,
-            event.programId,
-            event.version.toString(),
-            contentHash,
-            now,
-          ],
+          [],
         );
         if (inserted.length === 0) return { kind: 'already_applied' } as const;

[NoCoverage] EqualityOperator
src/capacity/application/apply-treasury-event.service.ts:139:13
             now,
           ],
         );
-        if (inserted.length === 0) return { kind: 'already_applied' } as const;
+        if (inserted.length !== 0) return { kind: 'already_applied' } as const;
 
         // FR-010a echo suppression: only the reservation event types carry a

[NoCoverage] ConditionalExpression
src/capacity/application/apply-treasury-event.service.ts:139:13
             now,
           ],
         );
-        if (inserted.length === 0) return { kind: 'already_applied' } as const;
+        if (true) return { kind: 'already_applied' } as const;
 
         // FR-010a echo suppression: only the reservation event types carry a

[NoCoverage] ConditionalExpression
src/capacity/application/apply-treasury-event.service.ts:146:11
         // service originated. Applying this to LIMIT_CHANGED would silently drop
         // a legitimate limit assertion that happened to carry the field.
         const isReservationEvent =
-          event.type === 'RESERVATION_BOOKED' ||
-          event.type === 'RESERVATION_RELEASED';
+          false;
         if (isReservationEvent && event.payload.reservationReference !== null) {
           const echo = await manager.query<{ id: string }[]>(

[NoCoverage] ConditionalExpression
src/capacity/application/apply-treasury-event.service.ts:146:11
         // service originated. Applying this to LIMIT_CHANGED would silently drop
         // a legitimate limit assertion that happened to carry the field.
         const isReservationEvent =
-          event.type === 'RESERVATION_BOOKED' ||
+          false ||
           event.type === 'RESERVATION_RELEASED';
         if (isReservationEvent && event.payload.reservationReference !== null) {

[NoCoverage] EqualityOperator
src/capacity/application/apply-treasury-event.service.ts:147:11
         // a legitimate limit assertion that happened to carry the field.
         const isReservationEvent =
           event.type === 'RESERVATION_BOOKED' ||
-          event.type === 'RESERVATION_RELEASED';
+          event.type !== 'RESERVATION_RELEASED';
         if (isReservationEvent && event.payload.reservationReference !== null) {
           const echo = await manager.query<{ id: string }[]>(

[NoCoverage] ConditionalExpression
src/capacity/application/apply-treasury-event.service.ts:147:11
         // a legitimate limit assertion that happened to carry the field.
         const isReservationEvent =
           event.type === 'RESERVATION_BOOKED' ||
-          event.type === 'RESERVATION_RELEASED';
+          false;
         if (isReservationEvent && event.payload.reservationReference !== null) {
           const echo = await manager.query<{ id: string }[]>(

[NoCoverage] ConditionalExpression
src/capacity/application/apply-treasury-event.service.ts:148:13
         const isReservationEvent =
           event.type === 'RESERVATION_BOOKED' ||
           event.type === 'RESERVATION_RELEASED';
-        if (isReservationEvent && event.payload.reservationReference !== null) {
+        if (false) {
           const echo = await manager.query<{ id: string }[]>(
             `SELECT id FROM invoice_reservation

[NoCoverage] EqualityOperator
src/capacity/application/apply-treasury-event.service.ts:148:35
         const isReservationEvent =
           event.type === 'RESERVATION_BOOKED' ||
           event.type === 'RESERVATION_RELEASED';
-        if (isReservationEvent && event.payload.reservationReference !== null) {
+        if (isReservationEvent && event.payload.reservationReference === null) {
           const echo = await manager.query<{ id: string }[]>(
             `SELECT id FROM invoice_reservation

[NoCoverage] EqualityOperator
src/capacity/application/apply-treasury-event.service.ts:154:15
               WHERE program_id = $1 AND treasury_reference = $2`,
             [event.programId, event.payload.reservationReference],
           );
-          if (echo.length > 0) {
+          if (echo.length <= 0) {
             await manager.query(
               `UPDATE invoice_reservation

[NoCoverage] ConditionalExpression
src/capacity/application/apply-treasury-event.service.ts:154:15
               WHERE program_id = $1 AND treasury_reference = $2`,
             [event.programId, event.payload.reservationReference],
           );
-          if (echo.length > 0) {
+          if (true) {
             await manager.query(
               `UPDATE invoice_reservation

[NoCoverage] StringLiteral
src/capacity/application/apply-treasury-event.service.ts:156:15
           );
           if (echo.length > 0) {
             await manager.query(
-              `UPDATE invoice_reservation
-                  SET treasury_acknowledged = TRUE,
-                      acknowledged_by_version = $3,
-                      updated_at = $4
-                WHERE program_id = $1 AND treasury_reference = $2
-                  AND treasury_acknowledged = FALSE`,
+              ``,
               [
                 event.programId,

[NoCoverage] ConditionalExpression
src/capacity/application/apply-treasury-event.service.ts:232:7
     const correlationId = event.correlationId ?? event.messageId;
 
     switch (event.type) {
-      case 'RESERVATION_BOOKED':
-        return {
-          deltaMinor: event.payload.amountMinor,
-          component: 'TREASURY',
-          cause: 'TREASURY_EVENT',
-          originReference:
-            event.payload.reservationReference ?? event.messageId,
-          actor,
-          correlationId,
-        };
+      case 'RESERVATION_BOOKED':
       case 'RESERVATION_RELEASED':
         return {

[NoCoverage] LogicalOperator
src/capacity/application/apply-treasury-event.service.ts:238:13
           component: 'TREASURY',
           cause: 'TREASURY_EVENT',
           originReference:
-            event.payload.reservationReference ?? event.messageId,
+            event.payload.reservationReference && event.messageId,
           actor,
           correlationId,

[NoCoverage] ConditionalExpression
src/capacity/application/apply-treasury-event.service.ts:242:7
           actor,
           correlationId,
         };
-      case 'RESERVATION_RELEASED':
-        return {
-          deltaMinor: -event.payload.amountMinor,
-          component: 'TREASURY',
-          cause: 'TREASURY_EVENT',
-          originReference:
-            event.payload.reservationReference ?? event.messageId,
-          actor,
-          correlationId,
-        };
+      case 'RESERVATION_RELEASED':
       case 'LIMIT_CHANGED':
         return {

[NoCoverage] ArithmeticOperator
src/capacity/application/apply-treasury-event.service.ts:254:23
         };
       case 'LIMIT_CHANGED':
         return {
-          deltaMinor: event.payload.amountMinor - program.creditLimitMinor,
+          deltaMinor: event.payload.amountMinor + program.creditLimitMinor,
           component: 'LIMIT',
           cause: 'LIMIT_CHANGE',
