[Killed] ArithmeticOperator
src/capacity/application/availability.projection.ts:94:19
   if (appliedEffectiveAt === null || newestObservedEffectiveAtMs === null) {
     return null;
   }
-  const deltaMs = newestObservedEffectiveAtMs - appliedEffectiveAt.getTime();
+  const deltaMs = newestObservedEffectiveAtMs + appliedEffectiveAt.getTime();
   return deltaMs <= 0 ? 0 : Math.floor(deltaMs / 1000);
 }
killedBy: toAvailabilityBody reports the whole seconds between the applied effective time and the observed head
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 65
Received: 3534451265

[Killed] EqualityOperator
src/capacity/application/availability.projection.ts:95:10
     return null;
   }
   const deltaMs = newestObservedEffectiveAtMs - appliedEffectiveAt.getTime();
-  return deltaMs <= 0 ? 0 : Math.floor(deltaMs / 1000);
+  return deltaMs > 0 ? 0 : Math.floor(deltaMs / 1000);
 }
 
killedBy: toAvailabilityBody reports the whole seconds between the applied effective time and the observed head
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 65
Received: 0

[Killed] ConditionalExpression
src/capacity/application/availability.projection.ts:95:10
     return null;
   }
   const deltaMs = newestObservedEffectiveAtMs - appliedEffectiveAt.getTime();
-  return deltaMs <= 0 ? 0 : Math.floor(deltaMs / 1000);
+  return true ? 0 : Math.floor(deltaMs / 1000);
 }
 
killedBy: toAvailabilityBody reports the whole seconds between the applied effective time and the observed head
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 65
Received: 0
