[NoCoverage] ConditionalExpression
src/capacity/application/availability.service.ts:64:12
        ) AS pending`,
       [programId],
     );
-    return rows[0]?.pending === true;
+    return true;
   }
 }

[NoCoverage] ConditionalExpression
src/capacity/application/availability.service.ts:64:12
        ) AS pending`,
       [programId],
     );
-    return rows[0]?.pending === true;
+    return false;
   }
 }
