[NoCoverage] BlockStatement
src/capacity/application/cancel.service.ts:112:53
           identity,
           now,
         );
-        if (idempotencyDecision.kind === 'refused') {
-          throw new CapacityRefusal(idempotencyDecision.code);
-        }
+        if (idempotencyDecision.kind === 'refused') {}
         if (idempotencyDecision.kind === 'replay') {
           return {

[NoCoverage] CallExpression
src/capacity/application/cancel.service.ts:113:11
           now,
         );
         if (idempotencyDecision.kind === 'refused') {
-          throw new CapacityRefusal(idempotencyDecision.code);
+          ;
         }
         if (idempotencyDecision.kind === 'replay') {

[NoCoverage] BlockStatement
src/capacity/application/cancel.service.ts:115:52
         if (idempotencyDecision.kind === 'refused') {
           throw new CapacityRefusal(idempotencyDecision.code);
         }
-        if (idempotencyDecision.kind === 'replay') {
-          return {
-            created: false,
-            body: idempotencyDecision.outcome as unknown as CancelBody,
-          };
-        }
+        if (idempotencyDecision.kind === 'replay') {}
 
         // FR-019e: while the program's position cannot be verified, every write

[NoCoverage] BooleanLiteral
src/capacity/application/cancel.service.ts:117:22
         }
         if (idempotencyDecision.kind === 'replay') {
           return {
-            created: false,
+            created: true,
             body: idempotencyDecision.outcome as unknown as CancelBody,
           };

[NoCoverage] ConditionalExpression
src/capacity/application/cancel.service.ts:125:13
         // FR-019e: while the program's position cannot be verified, every write
         // is refused — a cancellation returns capacity from the same cached
         // position, so it cannot be vouched for either.
-        if (program.positionVerified === false) {
+        if (false) {
           throw new CapacityRefusal('POSITION_UNVERIFIED');
         }

[NoCoverage] BlockStatement
src/capacity/application/cancel.service.ts:125:49
         // FR-019e: while the program's position cannot be verified, every write
         // is refused — a cancellation returns capacity from the same cached
         // position, so it cannot be vouched for either.
-        if (program.positionVerified === false) {
-          throw new CapacityRefusal('POSITION_UNVERIFIED');
-        }
+        if (program.positionVerified === false) {}
 
         const rows = await manager.query<InvoiceReservationRow[]>(

[NoCoverage] BooleanLiteral
src/capacity/application/cancel.service.ts:207:13
           ),
           availability: toAvailabilityBody(
             programAfter,
-            false,
+            true,
             this.streamLag.newestObservedFor(programAfter.id),
           ),

[NoCoverage] BooleanLiteral
src/capacity/application/cancel.service.ts:218:27
           body as unknown as Record<string, unknown>,
         );
 
-        return { created: true, body };
+        return { created: false, body };
       },
     );
