[NoCoverage] StringLiteral
src/capacity/application/idempotency.service.ts:44:21
   reason: string;
   note: string;
 }): string {
-  return createHash('sha256')
+  return createHash("")
     .update(`${input.programId}|${input.invoiceId}|${input.reason}|${input.note}`)
     .digest('hex');

[NoCoverage] StringLiteral
src/capacity/application/idempotency.service.ts:45:13
   note: string;
 }): string {
   return createHash('sha256')
-    .update(`${input.programId}|${input.invoiceId}|${input.reason}|${input.note}`)
+    .update(``)
     .digest('hex');
 }

[NoCoverage] StringLiteral
src/capacity/application/idempotency.service.ts:64:7
     now: Date,
   ): Promise<IdempotencyDecision> {
     const inserted = await manager.query<{ request_id: string }[]>(
-      `INSERT INTO request_record
-         (organisation_id, request_id, operation, content_fingerprint, state, outcome, recorded_at)
-       VALUES ($1, $2, $3, $4, 'PENDING', NULL, $5)
-       ON CONFLICT (organisation_id, request_id) DO NOTHING
-       RETURNING request_id`,
+      ``,
       [
         identity.organisationId,

[NoCoverage] EqualityOperator
src/capacity/application/idempotency.service.ts:78:9
       ],
     );
 
-    if (inserted.length > 0) {
+    if (inserted.length <= 0) {
       return { kind: 'proceed' };
     }

[NoCoverage] ConditionalExpression
src/capacity/application/idempotency.service.ts:78:9
       ],
     );
 
-    if (inserted.length > 0) {
+    if (false) {
       return { kind: 'proceed' };
     }

[NoCoverage] EqualityOperator
src/capacity/application/idempotency.service.ts:96:7
     // The operation is part of the identity: a key first used to reserve must
     // not replay a release (or vice versa), even when the content matches.
     if (
-      row.operation !== identity.operation ||
+      row.operation === identity.operation ||
       row.content_fingerprint !== identity.fingerprint
     ) {

[NoCoverage] ConditionalExpression
src/capacity/application/idempotency.service.ts:96:7
     // The operation is part of the identity: a key first used to reserve must
     // not replay a release (or vice versa), even when the content matches.
     if (
-      row.operation !== identity.operation ||
-      row.content_fingerprint !== identity.fingerprint
+      false
     ) {
       return { kind: 'refused', code: 'IDEMPOTENCY_CONFLICT' };

[NoCoverage] ConditionalExpression
src/capacity/application/idempotency.service.ts:97:7
     // not replay a release (or vice versa), even when the content matches.
     if (
       row.operation !== identity.operation ||
-      row.content_fingerprint !== identity.fingerprint
+      false
     ) {
       return { kind: 'refused', code: 'IDEMPOTENCY_CONFLICT' };

[NoCoverage] EqualityOperator
src/capacity/application/idempotency.service.ts:97:7
     // not replay a release (or vice versa), even when the content matches.
     if (
       row.operation !== identity.operation ||
-      row.content_fingerprint !== identity.fingerprint
+      row.content_fingerprint === identity.fingerprint
     ) {
       return { kind: 'refused', code: 'IDEMPOTENCY_CONFLICT' };

[NoCoverage] BlockStatement
src/capacity/application/idempotency.service.ts:98:7
     if (
       row.operation !== identity.operation ||
       row.content_fingerprint !== identity.fingerprint
-    ) {
-      return { kind: 'refused', code: 'IDEMPOTENCY_CONFLICT' };
-    }
+    ) {}
 
     switch (row.state) {

[NoCoverage] ConditionalExpression
src/capacity/application/idempotency.service.ts:103:7
     }
 
     switch (row.state) {
-      case 'PENDING':
-        return { kind: 'refused', code: 'REQUEST_IN_FLIGHT' };
+      case 'PENDING':
       case 'EXPIRED':
         return { kind: 'refused', code: 'IDEMPOTENCY_EXPIRED' };

[NoCoverage] ConditionalExpression
src/capacity/application/idempotency.service.ts:105:7
     switch (row.state) {
       case 'PENDING':
         return { kind: 'refused', code: 'REQUEST_IN_FLIGHT' };
-      case 'EXPIRED':
-        return { kind: 'refused', code: 'IDEMPOTENCY_EXPIRED' };
+      case 'EXPIRED':
       case 'COMPLETE':
         if (row.outcome === null) {

[NoCoverage] ConditionalExpression
src/capacity/application/idempotency.service.ts:107:7
         return { kind: 'refused', code: 'REQUEST_IN_FLIGHT' };
       case 'EXPIRED':
         return { kind: 'refused', code: 'IDEMPOTENCY_EXPIRED' };
-      case 'COMPLETE':
-        if (row.outcome === null) {
-          throw new Error(
-            'request_record is COMPLETE without an outcome; the state/outcome constraint was violated',
-          );
-        }
-        return { kind: 'replay', outcome: row.outcome };
+      case 'COMPLETE':
       default:
         throw new Error('unexpected request_record state');

[NoCoverage] StringLiteral
src/capacity/application/idempotency.service.ts:110:13
       case 'COMPLETE':
         if (row.outcome === null) {
           throw new Error(
-            'request_record is COMPLETE without an outcome; the state/outcome constraint was violated',
+            "",
           );
         }

[NoCoverage] BlockStatement
src/capacity/application/idempotency.service.ts:123:20
     manager: EntityManager,
     identity: RequestIdentity,
     outcome: Record<string, unknown>,
-  ): Promise<void> {
-    await manager.query(
-      `UPDATE request_record
-          SET state = 'COMPLETE', outcome = $3::jsonb
-        WHERE organisation_id = $1 AND request_id = $2`,
-      [identity.organisationId, identity.requestId, JSON.stringify(outcome)],
-    );
-  }
+  ): Promise<void> {}
 }
 

[NoCoverage] ArrayDeclaration
src/capacity/application/idempotency.service.ts:128:7
       `UPDATE request_record
           SET state = 'COMPLETE', outcome = $3::jsonb
         WHERE organisation_id = $1 AND request_id = $2`,
-      [identity.organisationId, identity.requestId, JSON.stringify(outcome)],
+      [],
     );
   }
