[NoCoverage] BlockStatement
src/capacity/application/reconciliation-check.job.ts:23:24
     private readonly config: ConfigService,
   ) {}
 
-  onModuleInit(): void {
-    const seconds = this.config.getOrThrow<number>(
-      'RECONCILIATION_INTERVAL_SECONDS',
-    );
-    const intervalId = setInterval(() => {
-      void this.service.check().catch((error: unknown) => {
-        const message = error instanceof Error ? error.message : String(error);
-        this.logger.error(`reconciliation check failed: ${message}`);
-      });
-    }, seconds * 1000);
-
-    this.schedulerRegistry.addInterval(
-      RECONCILIATION_INTERVAL_NAME,
-      intervalId,
-    );
-  }
+  onModuleInit(): void {}
 
   onModuleDestroy(): void {

[NoCoverage] BlockStatement
src/capacity/application/reconciliation-check.job.ts:27:42
     const seconds = this.config.getOrThrow<number>(
       'RECONCILIATION_INTERVAL_SECONDS',
     );
-    const intervalId = setInterval(() => {
-      void this.service.check().catch((error: unknown) => {
-        const message = error instanceof Error ? error.message : String(error);
-        this.logger.error(`reconciliation check failed: ${message}`);
-      });
-    }, seconds * 1000);
+    const intervalId = setInterval(() => {}, seconds * 1000);
 
     this.schedulerRegistry.addInterval(

[NoCoverage] BlockStatement
src/capacity/application/reconciliation-check.job.ts:28:59
       'RECONCILIATION_INTERVAL_SECONDS',
     );
     const intervalId = setInterval(() => {
-      void this.service.check().catch((error: unknown) => {
-        const message = error instanceof Error ? error.message : String(error);
-        this.logger.error(`reconciliation check failed: ${message}`);
-      });
+      void this.service.check().catch((error: unknown) => {});
     }, seconds * 1000);
 

[NoCoverage] StringLiteral
src/capacity/application/reconciliation-check.job.ts:30:27
     const intervalId = setInterval(() => {
       void this.service.check().catch((error: unknown) => {
         const message = error instanceof Error ? error.message : String(error);
-        this.logger.error(`reconciliation check failed: ${message}`);
+        this.logger.error(``);
       });
     }, seconds * 1000);

[NoCoverage] ArithmeticOperator
src/capacity/application/reconciliation-check.job.ts:32:8
         const message = error instanceof Error ? error.message : String(error);
         this.logger.error(`reconciliation check failed: ${message}`);
       });
-    }, seconds * 1000);
+    }, seconds / 1000);
 
     this.schedulerRegistry.addInterval(

[NoCoverage] CallExpression
src/capacity/application/reconciliation-check.job.ts:34:5
       });
     }, seconds * 1000);
 
-    this.schedulerRegistry.addInterval(
-      RECONCILIATION_INTERVAL_NAME,
-      intervalId,
-    );
+    ;
   }
 

[NoCoverage] BlockStatement
src/capacity/application/reconciliation-check.job.ts:40:27
     );
   }
 
-  onModuleDestroy(): void {
-    try {
-      this.schedulerRegistry.deleteInterval(RECONCILIATION_INTERVAL_NAME);
-    } catch {
-      // No interval registered under this name; nothing to clear.
-    }
-  }
+  onModuleDestroy(): void {}
 }
 

[NoCoverage] BlockStatement
src/capacity/application/reconciliation-check.job.ts:41:9
   }
 
   onModuleDestroy(): void {
-    try {
-      this.schedulerRegistry.deleteInterval(RECONCILIATION_INTERVAL_NAME);
-    } catch {
+    try {} catch {
       // No interval registered under this name; nothing to clear.
     }

[NoCoverage] CallExpression
src/capacity/application/reconciliation-check.job.ts:42:7
 
   onModuleDestroy(): void {
     try {
-      this.schedulerRegistry.deleteInterval(RECONCILIATION_INTERVAL_NAME);
+      ;
     } catch {
       // No interval registered under this name; nothing to clear.
