[Killed] BlockStatement
src/capacity/application/reconciliation-check.service.ts:46:29
 
     const mismatches: ReconciliationMismatch[] = [];
 
-    for (const row of rows) {
-      const expected = BigInt(row.active_outstanding);
-      const actual = BigInt(row.local_reserved_minor);
-      if (expected === actual) {
-        continue;
-      }
-
-      mismatches.push({ programId: row.program_id, expected, actual });
-      await this.dataSource.query(
-        `UPDATE program
-            SET investigation_required = TRUE
-          WHERE id = $1
-            AND investigation_required = FALSE`,
-        [row.program_id],
-      );
-    }
+    for (const row of rows) {}
 
     investigationRequiredPrograms.set(mismatches.length);
killedBy: ReconciliationCheckService flags a mismatched program and writes no position column
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/capacity/application/reconciliation-check.service.ts:49:11
     for (const row of rows) {
       const expected = BigInt(row.active_outstanding);
       const actual = BigInt(row.local_reserved_minor);
-      if (expected === actual) {
+      if (false) {
         continue;
       }
killedBy: ReconciliationCheckService writes nothing and reports zero when every program reconciles
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 7

- Array []
+ Array [
+   Object {

[Killed] EqualityOperator
src/capacity/application/reconciliation-check.service.ts:49:11
     for (const row of rows) {
       const expected = BigInt(row.active_outstanding);
       const actual = BigInt(row.local_reserved_minor);
-      if (expected === actual) {
+      if (expected !== actual) {
         continue;
       }
killedBy: ReconciliationCheckService flags a mismatched program and writes no position column
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] CallExpression
src/capacity/application/reconciliation-check.service.ts:63:5
       );
     }
 
-    investigationRequiredPrograms.set(mismatches.length);
+    ;
 
     return { programsChecked: rows.length, mismatches };
killedBy: ReconciliationCheckService flags a mismatched program and writes no position column
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0
