[NoCoverage] BlockStatement
src/capacity/application/recovery-detection.service.ts:18:39
 export class RecoveryDetectionService implements OnModuleInit {
   constructor(private readonly dataSource: DataSource) {}
 
-  async onModuleInit(): Promise<void> {
-    await this.detect();
-  }
+  async onModuleInit(): Promise<void> {}
 
   // FR-019e. A program whose recorded stream position is older than its newest

[NoCoverage] BlockStatement
src/capacity/application/recovery-detection.service.ts:48:29
     );
 
     const flagged: string[] = [];
-    for (const row of rows) {
-      if (row.ledger_at === null) {
-        continue;
-      }
-      const ledgerAt = new Date(row.ledger_at);
-      const positionAt = row.position_at === null ? null : new Date(row.position_at);
-      if (positionAt !== null && positionAt >= ledgerAt) {
-        continue;
-      }
-
-      await this.dataSource.query(
-        `UPDATE program SET position_verified = FALSE WHERE id = $1`,
-        [row.program_id],
-      );
-      flagged.push(row.program_id);
-    }
+    for (const row of rows) {}
 
     return { flagged };

[NoCoverage] BlockStatement
src/capacity/application/recovery-detection.service.ts:54:58
       }
       const ledgerAt = new Date(row.ledger_at);
       const positionAt = row.position_at === null ? null : new Date(row.position_at);
-      if (positionAt !== null && positionAt >= ledgerAt) {
-        continue;
-      }
+      if (positionAt !== null && positionAt >= ledgerAt) {}
 
       await this.dataSource.query(

[NoCoverage] EqualityOperator
src/capacity/application/recovery-detection.service.ts:54:34
       }
       const ledgerAt = new Date(row.ledger_at);
       const positionAt = row.position_at === null ? null : new Date(row.position_at);
-      if (positionAt !== null && positionAt >= ledgerAt) {
+      if (positionAt !== null && positionAt > ledgerAt) {
         continue;
       }

[NoCoverage] StringLiteral
src/capacity/application/recovery-detection.service.ts:59:9
       }
 
       await this.dataSource.query(
-        `UPDATE program SET position_verified = FALSE WHERE id = $1`,
+        ``,
         [row.program_id],
       );

[NoCoverage] CallExpression
src/capacity/application/recovery-detection.service.ts:62:7
         `UPDATE program SET position_verified = FALSE WHERE id = $1`,
         [row.program_id],
       );
-      flagged.push(row.program_id);
+      ;
     }
 
