[NoCoverage] BlockStatement
src/capacity/application/release.service.ts:118:52
         if (idempotencyDecision.kind === 'refused') {
           throw new CapacityRefusal(idempotencyDecision.code);
         }
-        if (idempotencyDecision.kind === 'replay') {
-          return {
-            created: false,
-            body: idempotencyDecision.outcome as unknown as ReleaseBody,
-          };
-        }
+        if (idempotencyDecision.kind === 'replay') {}
 
         // FR-019e: while the program's position cannot be verified, every write

[NoCoverage] BooleanLiteral
src/capacity/application/release.service.ts:128:42
         // FR-019e: while the program's position cannot be verified, every write
         // is refused — a release draws on the same cached position a reservation
         // does, so it cannot be vouched for either.
-        if (program.positionVerified === false) {
+        if (program.positionVerified === true) {
           throw new CapacityRefusal('POSITION_UNVERIFIED');
         }

[NoCoverage] EqualityOperator
src/capacity/application/release.service.ts:128:13
         // FR-019e: while the program's position cannot be verified, every write
         // is refused — a release draws on the same cached position a reservation
         // does, so it cannot be vouched for either.
-        if (program.positionVerified === false) {
+        if (program.positionVerified !== false) {
           throw new CapacityRefusal('POSITION_UNVERIFIED');
         }

[NoCoverage] ArrayDeclaration
src/capacity/application/release.service.ts:177:11
 
         const result = advancePosition(
           this.programRepository.toPosition(program),
-          [ledgerEntry],
+          [],
           now,
         );
