[NoCoverage] ArithmeticOperator
src/capacity/application/request-retention.job.ts:12:37
 import { DataSource } from 'typeorm';
 
 const RETENTION_INTERVAL_NAME = 'request-retention';
-const RETENTION_SWEEP_INTERVAL_MS = 60 * 60 * 1000;
+const RETENTION_SWEEP_INTERVAL_MS = 60 * 60 / 1000;
 
 @Injectable()

[NoCoverage] ArithmeticOperator
src/capacity/application/request-retention.job.ts:12:37
 import { DataSource } from 'typeorm';
 
 const RETENTION_INTERVAL_NAME = 'request-retention';
-const RETENTION_SWEEP_INTERVAL_MS = 60 * 60 * 1000;
+const RETENTION_SWEEP_INTERVAL_MS = 60 / 60 * 1000;
 
 @Injectable()

[NoCoverage] ArithmeticOperator
src/capacity/application/request-retention.job.ts:26:29
 
   async sweep(): Promise<number> {
     const days = this.config.getOrThrow<number>('REQUEST_RETENTION_DAYS');
-    const cutoff = new Date(Date.now() - days * 24 * 60 * 60 * 1000);
+    const cutoff = new Date(Date.now() + days * 24 * 60 * 60 * 1000);
 
     const [, affected] = await this.dataSource.query<[unknown[], number]>(

[NoCoverage] ArithmeticOperator
src/capacity/application/request-retention.job.ts:26:42
 
   async sweep(): Promise<number> {
     const days = this.config.getOrThrow<number>('REQUEST_RETENTION_DAYS');
-    const cutoff = new Date(Date.now() - days * 24 * 60 * 60 * 1000);
+    const cutoff = new Date(Date.now() - days * 24 * 60 / 60 * 1000);
 
     const [, affected] = await this.dataSource.query<[unknown[], number]>(

[NoCoverage] StringLiteral
src/capacity/application/request-retention.job.ts:37:7
     );
 
     const stuckRows = await this.dataSource.query<{ stuck: number }[]>(
-      `SELECT count(*)::int AS stuck
-         FROM request_record
-        WHERE state = 'PENDING'
-          AND recorded_at < $1`,
+      ``,
       [cutoff],
     );

[NoCoverage] EqualityOperator
src/capacity/application/request-retention.job.ts:45:9
     );
     const stuck = stuckRows[0]?.stuck ?? 0;
 
-    if (stuck > 0) {
+    if (stuck >= 0) {
       this.logger.warn(
         `${stuck} request_record row(s) have been PENDING since before the retention cutoff; a writer crashed mid-request and the key cannot be replayed or reused`,

[NoCoverage] EqualityOperator
src/capacity/application/request-retention.job.ts:45:9
     );
     const stuck = stuckRows[0]?.stuck ?? 0;
 
-    if (stuck > 0) {
+    if (stuck <= 0) {
       this.logger.warn(
         `${stuck} request_record row(s) have been PENDING since before the retention cutoff; a writer crashed mid-request and the key cannot be replayed or reused`,

[NoCoverage] StringLiteral
src/capacity/application/request-retention.job.ts:47:9
 
     if (stuck > 0) {
       this.logger.warn(
-        `${stuck} request_record row(s) have been PENDING since before the retention cutoff; a writer crashed mid-request and the key cannot be replayed or reused`,
+        ``,
       );
     }

[NoCoverage] BlockStatement
src/capacity/application/request-retention.job.ts:54:24
     return affected;
   }
 
-  onModuleInit(): void {
-    const intervalId = setInterval(() => {
-      void this.sweep().catch((error: unknown) => {
-        const message = error instanceof Error ? error.message : String(error);
-        this.logger.error(`request retention sweep failed: ${message}`);
-      });
-    }, RETENTION_SWEEP_INTERVAL_MS);
-
-    this.schedulerRegistry.addInterval(RETENTION_INTERVAL_NAME, intervalId);
-  }
+  onModuleInit(): void {}
 
   onModuleDestroy(): void {

[NoCoverage] BlockStatement
src/capacity/application/request-retention.job.ts:55:42
   }
 
   onModuleInit(): void {
-    const intervalId = setInterval(() => {
-      void this.sweep().catch((error: unknown) => {
-        const message = error instanceof Error ? error.message : String(error);
-        this.logger.error(`request retention sweep failed: ${message}`);
-      });
-    }, RETENTION_SWEEP_INTERVAL_MS);
+    const intervalId = setInterval(() => {}, RETENTION_SWEEP_INTERVAL_MS);
 
     this.schedulerRegistry.addInterval(RETENTION_INTERVAL_NAME, intervalId);

[NoCoverage] BlockStatement
src/capacity/application/request-retention.job.ts:56:51
 
   onModuleInit(): void {
     const intervalId = setInterval(() => {
-      void this.sweep().catch((error: unknown) => {
-        const message = error instanceof Error ? error.message : String(error);
-        this.logger.error(`request retention sweep failed: ${message}`);
-      });
+      void this.sweep().catch((error: unknown) => {});
     }, RETENTION_SWEEP_INTERVAL_MS);
 

[NoCoverage] CallExpression
src/capacity/application/request-retention.job.ts:62:5
       });
     }, RETENTION_SWEEP_INTERVAL_MS);
 
-    this.schedulerRegistry.addInterval(RETENTION_INTERVAL_NAME, intervalId);
+    ;
   }
 

[NoCoverage] BlockStatement
src/capacity/application/request-retention.job.ts:65:27
     this.schedulerRegistry.addInterval(RETENTION_INTERVAL_NAME, intervalId);
   }
 
-  onModuleDestroy(): void {
-    try {
-      this.schedulerRegistry.deleteInterval(RETENTION_INTERVAL_NAME);
-    } catch {
-      // No interval registered under this name; nothing to clear.
-    }
-  }
+  onModuleDestroy(): void {}
 }
 

[NoCoverage] BlockStatement
src/capacity/application/request-retention.job.ts:66:9
   }
 
   onModuleDestroy(): void {
-    try {
-      this.schedulerRegistry.deleteInterval(RETENTION_INTERVAL_NAME);
-    } catch {
+    try {} catch {
       // No interval registered under this name; nothing to clear.
     }

[NoCoverage] CallExpression
src/capacity/application/request-retention.job.ts:67:7
 
   onModuleDestroy(): void {
     try {
-      this.schedulerRegistry.deleteInterval(RETENTION_INTERVAL_NAME);
+      ;
     } catch {
       // No interval registered under this name; nothing to clear.
