[NoCoverage] BlockStatement
src/capacity/application/reserve.service.ts:120:52
         if (idempotencyDecision.kind === 'refused') {
           throw new CapacityRefusal(idempotencyDecision.code);
         }
-        if (idempotencyDecision.kind === 'replay') {
-          return {
-            created: false,
-            body: idempotencyDecision.outcome as unknown as ReserveBody,
-          };
-        }
+        if (idempotencyDecision.kind === 'replay') {}
 
         const duplicate = await manager.query<{ present: number }[]>(

[NoCoverage] BlockStatement
src/capacity/application/reserve.service.ts:133:35
             WHERE program_id = $1 AND invoice_id = $2`,
           [command.programId, command.invoiceId],
         );
-        if (duplicate.length > 0) {
-          throw new CapacityRefusal('DUPLICATE_INVOICE');
-        }
+        if (duplicate.length > 0) {}
 
         let fx: FxResolution;

[NoCoverage] EqualityOperator
src/capacity/application/reserve.service.ts:133:13
             WHERE program_id = $1 AND invoice_id = $2`,
           [command.programId, command.invoiceId],
         );
-        if (duplicate.length > 0) {
+        if (duplicate.length <= 0) {
           throw new CapacityRefusal('DUPLICATE_INVOICE');
         }

[NoCoverage] EqualityOperator
src/capacity/application/reserve.service.ts:138:13
         }
 
         let fx: FxResolution;
-        if (command.currency === program.currency) {
+        if (command.currency !== program.currency) {
           fx = { kind: 'sameCurrency' };
         } else {

[NoCoverage] ConditionalExpression
src/capacity/application/reserve.service.ts:138:13
         }
 
         let fx: FxResolution;
-        if (command.currency === program.currency) {
+        if (false) {
           fx = { kind: 'sameCurrency' };
         } else {

[NoCoverage] StringLiteral
src/capacity/application/reserve.service.ts:156:43
         });
 
         if (decision.kind === 'refused') {
-          reservationOutcomesTotal.labels('refused', decision.code).inc();
+          reservationOutcomesTotal.labels("", decision.code).inc();
           throw new CapacityRefusal(decision.code, decision.details);
         }

[NoCoverage] StringLiteral
src/capacity/application/reserve.service.ts:162:11
 
         const appliedFx = decision.fx;
         const insertedRows = await manager.query<InvoiceReservationRow[]>(
-          `INSERT INTO invoice_reservation
-             (program_id, invoice_id, invoice_amount_minor, invoice_currency,
-              program_currency, reserved_minor, outstanding_invoice_minor,
-              outstanding_reserved_minor, fx_rate, fx_rate_effective_at,
-              fx_rate_source, status, origin, treasury_acknowledged,
-              acknowledged_by_version, treasury_reference, confirmed_at,
-              created_at, updated_at)
-           VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, 'ACTIVE',
-                   'LOCAL', FALSE, NULL, NULL, $12, $12, $12)
-           RETURNING *`,
+          ``,
           [
             command.programId,

[NoCoverage] LogicalOperator
src/capacity/application/reserve.service.ts:181:13
             decision.reservedMinor.toString(),
             command.amountMinor.toString(),
             decision.reservedMinor.toString(),
-            appliedFx?.rate ?? null,
+            appliedFx?.rate && null,
             appliedFx?.effectiveAt ?? null,
             appliedFx?.source ?? null,

[NoCoverage] LogicalOperator
src/capacity/application/reserve.service.ts:182:13
             command.amountMinor.toString(),
             decision.reservedMinor.toString(),
             appliedFx?.rate ?? null,
-            appliedFx?.effectiveAt ?? null,
+            appliedFx?.effectiveAt && null,
             appliedFx?.source ?? null,
             now,

[NoCoverage] LogicalOperator
src/capacity/application/reserve.service.ts:183:13
             decision.reservedMinor.toString(),
             appliedFx?.rate ?? null,
             appliedFx?.effectiveAt ?? null,
-            appliedFx?.source ?? null,
+            appliedFx?.source && null,
             now,
           ],

[NoCoverage] BooleanLiteral
src/capacity/application/reserve.service.ts:240:27
         );
 
         reservationOutcomesTotal.labels('accepted', 'none').inc();
-        return { created: true, body };
+        return { created: false, body };
       },
     );
