[NoCoverage] EqualityOperator
capacity/domain/policies/apply-snapshot.policy.ts:54:7
   marker: SnapshotMarkerInput,
   reservation: SnapshotReservation,
 ): boolean {
-  if (marker.kind === 'EXPLICIT') {
+  if (marker.kind !== 'EXPLICIT') {
     return (
       reservation.treasuryReference !== null &&

[NoCoverage] BlockStatement
capacity/domain/policies/apply-snapshot.policy.ts:54:35
   marker: SnapshotMarkerInput,
   reservation: SnapshotReservation,
 ): boolean {
-  if (marker.kind === 'EXPLICIT') {
-    return (
-      reservation.treasuryReference !== null &&
-      (marker.reservationReferences ?? []).includes(reservation.treasuryReference)
-    );
-  }
+  if (marker.kind === 'EXPLICIT') {}
   return (
     marker.ingestedThrough !== null &&

[NoCoverage] ConditionalExpression
capacity/domain/policies/apply-snapshot.policy.ts:56:7
 ): boolean {
   if (marker.kind === 'EXPLICIT') {
     return (
-      reservation.treasuryReference !== null &&
-      (marker.reservationReferences ?? []).includes(reservation.treasuryReference)
+      false
     );
   }

[NoCoverage] ConditionalExpression
capacity/domain/policies/apply-snapshot.policy.ts:56:7
 ): boolean {
   if (marker.kind === 'EXPLICIT') {
     return (
-      reservation.treasuryReference !== null &&
-      (marker.reservationReferences ?? []).includes(reservation.treasuryReference)
+      true
     );
   }

[NoCoverage] ConditionalExpression
capacity/domain/policies/apply-snapshot.policy.ts:61:5
     );
   }
   return (
-    marker.ingestedThrough !== null &&
-    reservation.confirmedAt.getTime() <= marker.ingestedThrough.getTime()
+    false
   );
 }

[NoCoverage] ConditionalExpression
capacity/domain/policies/apply-snapshot.policy.ts:61:5
     );
   }
   return (
-    marker.ingestedThrough !== null &&
-    reservation.confirmedAt.getTime() <= marker.ingestedThrough.getTime()
+    true
   );
 }

[NoCoverage] EqualityOperator
capacity/domain/policies/apply-snapshot.policy.ts:62:5
   }
   return (
     marker.ingestedThrough !== null &&
-    reservation.confirmedAt.getTime() <= marker.ingestedThrough.getTime()
+    reservation.confirmedAt.getTime() > marker.ingestedThrough.getTime()
   );
 }

[NoCoverage] ConditionalExpression
capacity/domain/policies/apply-snapshot.policy.ts:62:5
   }
   return (
     marker.ingestedThrough !== null &&
-    reservation.confirmedAt.getTime() <= marker.ingestedThrough.getTime()
+    true
   );
 }

[NoCoverage] ArrayDeclaration
capacity/domain/policies/apply-snapshot.policy.ts:80:48
   // 1. Apply the acknowledgement marker. FR-011e: a marker from a snapshot no
   //    newer than the one that last acknowledged a reservation is not applied to
   //    it — the stale marker skips that reservation and the rest proceeds.
-  const acknowledgedReservationIds: string[] = [];
+  const acknowledgedReservationIds: string[] = ["Stryker was here"];
   const marked: SnapshotReservation[] = reservations.map((reservation) => {
     if (!markerMatches(marker, reservation)) {

[NoCoverage] BlockStatement
capacity/domain/policies/apply-snapshot.policy.ts:82:46
   //    it — the stale marker skips that reservation and the rest proceeds.
   const acknowledgedReservationIds: string[] = [];
   const marked: SnapshotReservation[] = reservations.map((reservation) => {
-    if (!markerMatches(marker, reservation)) {
-      return reservation;
-    }
+    if (!markerMatches(marker, reservation)) {}
     if (
       reservation.acknowledgedByVersion !== null &&

[NoCoverage] BooleanLiteral
capacity/domain/policies/apply-snapshot.policy.ts:82:9
   //    it — the stale marker skips that reservation and the rest proceeds.
   const acknowledgedReservationIds: string[] = [];
   const marked: SnapshotReservation[] = reservations.map((reservation) => {
-    if (!markerMatches(marker, reservation)) {
+    if (markerMatches(marker, reservation)) {
       return reservation;
     }

[NoCoverage] ConditionalExpression
capacity/domain/policies/apply-snapshot.policy.ts:86:7
       return reservation;
     }
     if (
-      reservation.acknowledgedByVersion !== null &&
-      reservation.acknowledgedByVersion >= version
+      true
     ) {
       return reservation;

[NoCoverage] ConditionalExpression
capacity/domain/policies/apply-snapshot.policy.ts:86:7
       return reservation;
     }
     if (
-      reservation.acknowledgedByVersion !== null &&
-      reservation.acknowledgedByVersion >= version
+      false
     ) {
       return reservation;

[NoCoverage] ConditionalExpression
capacity/domain/policies/apply-snapshot.policy.ts:87:7
     }
     if (
       reservation.acknowledgedByVersion !== null &&
-      reservation.acknowledgedByVersion >= version
+      true
     ) {
       return reservation;

[NoCoverage] EqualityOperator
capacity/domain/policies/apply-snapshot.policy.ts:87:7
     }
     if (
       reservation.acknowledgedByVersion !== null &&
-      reservation.acknowledgedByVersion >= version
+      reservation.acknowledgedByVersion < version
     ) {
       return reservation;

[NoCoverage] BlockStatement
capacity/domain/policies/apply-snapshot.policy.ts:88:7
     if (
       reservation.acknowledgedByVersion !== null &&
       reservation.acknowledgedByVersion >= version
-    ) {
-      return reservation;
-    }
+    ) {}
     acknowledgedReservationIds.push(reservation.id);
     return {

[NoCoverage] CallExpression
capacity/domain/policies/apply-snapshot.policy.ts:91:5
     ) {
       return reservation;
     }
-    acknowledgedReservationIds.push(reservation.id);
+    ;
     return {
       ...reservation,

[NoCoverage] BooleanLiteral
capacity/domain/policies/apply-snapshot.policy.ts:94:29
     acknowledgedReservationIds.push(reservation.id);
     return {
       ...reservation,
-      treasuryAcknowledged: true,
+      treasuryAcknowledged: false,
       acknowledgedByVersion: version,
     };

[NoCoverage] BlockStatement
capacity/domain/policies/apply-snapshot.policy.ts:102:37
   // 2. The sums, computed after the marker has been applied.
   let ackedLocal = 0n;
   let localTotal = 0n;
-  for (const reservation of marked) {
-    if (reservation.origin !== 'LOCAL') {
-      continue;
-    }
-    localTotal += reservation.outstandingReservedMinor;
-    if (reservation.treasuryAcknowledged) {
-      ackedLocal += reservation.outstandingReservedMinor;
-    }
-  }
+  for (const reservation of marked) {}
 
   // 3. Targets. The decomposition is only valid while the snapshot's reserved

[NoCoverage] ConditionalExpression
capacity/domain/policies/apply-snapshot.policy.ts:103:9
   let ackedLocal = 0n;
   let localTotal = 0n;
   for (const reservation of marked) {
-    if (reservation.origin !== 'LOCAL') {
+    if (true) {
       continue;
     }

[NoCoverage] EqualityOperator
capacity/domain/policies/apply-snapshot.policy.ts:103:9
   let ackedLocal = 0n;
   let localTotal = 0n;
   for (const reservation of marked) {
-    if (reservation.origin !== 'LOCAL') {
+    if (reservation.origin === 'LOCAL') {
       continue;
     }

[NoCoverage] AssignmentOperator
capacity/domain/policies/apply-snapshot.policy.ts:106:5
     if (reservation.origin !== 'LOCAL') {
       continue;
     }
-    localTotal += reservation.outstandingReservedMinor;
+    localTotal -= reservation.outstandingReservedMinor;
     if (reservation.treasuryAcknowledged) {
       ackedLocal += reservation.outstandingReservedMinor;

[NoCoverage] BlockStatement
capacity/domain/policies/apply-snapshot.policy.ts:107:43
       continue;
     }
     localTotal += reservation.outstandingReservedMinor;
-    if (reservation.treasuryAcknowledged) {
-      ackedLocal += reservation.outstandingReservedMinor;
-    }
+    if (reservation.treasuryAcknowledged) {}
   }
 

[NoCoverage] ConditionalExpression
capacity/domain/policies/apply-snapshot.policy.ts:107:9
       continue;
     }
     localTotal += reservation.outstandingReservedMinor;
-    if (reservation.treasuryAcknowledged) {
+    if (false) {
       ackedLocal += reservation.outstandingReservedMinor;
     }

[NoCoverage] AssignmentOperator
capacity/domain/policies/apply-snapshot.policy.ts:108:7
     }
     localTotal += reservation.outstandingReservedMinor;
     if (reservation.treasuryAcknowledged) {
-      ackedLocal += reservation.outstandingReservedMinor;
+      ackedLocal -= reservation.outstandingReservedMinor;
     }
   }

[NoCoverage] ArithmeticOperator
capacity/domain/policies/apply-snapshot.policy.ts:115:26
   // 3. Targets. The decomposition is only valid while the snapshot's reserved
   //    total genuinely includes every reservation its marker acknowledges; a
   //    negative target would write a negative TREASURY component, so refuse.
-  const targetTreasury = reservedMinor - ackedLocal;
+  const targetTreasury = reservedMinor + ackedLocal;
   if (targetTreasury < 0n) {
     return { kind: 'refuse', reason: 'SNAPSHOT_INCONSISTENT' };

[NoCoverage] ConditionalExpression
capacity/domain/policies/apply-snapshot.policy.ts:116:7
   //    total genuinely includes every reservation its marker acknowledges; a
   //    negative target would write a negative TREASURY component, so refuse.
   const targetTreasury = reservedMinor - ackedLocal;
-  if (targetTreasury < 0n) {
+  if (true) {
     return { kind: 'refuse', reason: 'SNAPSHOT_INCONSISTENT' };
   }

[NoCoverage] EqualityOperator
capacity/domain/policies/apply-snapshot.policy.ts:116:7
   //    total genuinely includes every reservation its marker acknowledges; a
   //    negative target would write a negative TREASURY component, so refuse.
   const targetTreasury = reservedMinor - ackedLocal;
-  if (targetTreasury < 0n) {
+  if (targetTreasury >= 0n) {
     return { kind: 'refuse', reason: 'SNAPSHOT_INCONSISTENT' };
   }

[NoCoverage] ConditionalExpression
capacity/domain/policies/apply-snapshot.policy.ts:125:28
   return {
     kind: 'apply',
     acknowledgedReservationIds,
-    investigationRequired: targetLocal !== program.localReservedMinor,
+    investigationRequired: true,
     deltas: {
       treasury: targetTreasury - program.treasuryReservedMinor,

[NoCoverage] EqualityOperator
capacity/domain/policies/apply-snapshot.policy.ts:125:28
   return {
     kind: 'apply',
     acknowledgedReservationIds,
-    investigationRequired: targetLocal !== program.localReservedMinor,
+    investigationRequired: targetLocal === program.localReservedMinor,
     deltas: {
       treasury: targetTreasury - program.treasuryReservedMinor,

[NoCoverage] ArithmeticOperator
capacity/domain/policies/apply-snapshot.policy.ts:127:17
     acknowledgedReservationIds,
     investigationRequired: targetLocal !== program.localReservedMinor,
     deltas: {
-      treasury: targetTreasury - program.treasuryReservedMinor,
+      treasury: targetTreasury + program.treasuryReservedMinor,
       local: targetLocal - program.localReservedMinor,
       limit: creditLimitMinor - program.creditLimitMinor,

[NoCoverage] ArithmeticOperator
capacity/domain/policies/apply-snapshot.policy.ts:128:14
     investigationRequired: targetLocal !== program.localReservedMinor,
     deltas: {
       treasury: targetTreasury - program.treasuryReservedMinor,
-      local: targetLocal - program.localReservedMinor,
+      local: targetLocal + program.localReservedMinor,
       limit: creditLimitMinor - program.creditLimitMinor,
     },

[NoCoverage] ArithmeticOperator
capacity/domain/policies/apply-snapshot.policy.ts:129:14
     deltas: {
       treasury: targetTreasury - program.treasuryReservedMinor,
       local: targetLocal - program.localReservedMinor,
-      limit: creditLimitMinor - program.creditLimitMinor,
+      limit: creditLimitMinor + program.creditLimitMinor,
     },
   };
