[Killed] ArrayDeclaration
capacity/domain/policies/cancel.policy.ts:13:79
   readonly status: 'CANCELLED' | 'WRITTEN_OFF';
 }
 
-const TERMINAL_STATUSES: ReadonlySet<ReservationSnapshot['status']> = new Set([
-  'FULLY_RELEASED',
-  'CANCELLED',
-  'WRITTEN_OFF',
-]);
+const TERMINAL_STATUSES: ReadonlySet<ReservationSnapshot['status']> = new Set([]);
 
 // The cause is chosen by what already happened to the reservation, never by the
killedBy: cancelPolicy refuses a reservation already in terminal status FULLY_RELEASED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
capacity/domain/policies/cancel.policy.ts:25:7
 export function cancelPolicy(
   reservation: ReservationSnapshot,
 ): Result<CancelDecision, CancelRefusal> {
-  if (TERMINAL_STATUSES.has(reservation.status)) {
+  if (false) {
     return err('RESERVATION_TERMINAL');
   }
killedBy: cancelPolicy refuses a reservation already in terminal status FULLY_RELEASED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
capacity/domain/policies/cancel.policy.ts:25:50
 export function cancelPolicy(
   reservation: ReservationSnapshot,
 ): Result<CancelDecision, CancelRefusal> {
-  if (TERMINAL_STATUSES.has(reservation.status)) {
-    return err('RESERVATION_TERMINAL');
-  }
+  if (TERMINAL_STATUSES.has(reservation.status)) {}
 
   if (reservation.status === 'PARTIALLY_RELEASED') {
killedBy: cancelPolicy refuses a reservation already in terminal status FULLY_RELEASED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
capacity/domain/policies/cancel.policy.ts:29:7
     return err('RESERVATION_TERMINAL');
   }
 
-  if (reservation.status === 'PARTIALLY_RELEASED') {
+  if (reservation.status !== 'PARTIALLY_RELEASED') {
     return ok({
       deltaMinor: reservation.outstandingReservedMinor,
killedBy: cancelPolicy cancels an ACTIVE reservation with cause CANCELLATION and returns the whole reserved remainder
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CANCELLATION"
Received: "WRITE_OFF"

[Killed] BlockStatement
capacity/domain/policies/cancel.policy.ts:29:52
     return err('RESERVATION_TERMINAL');
   }
 
-  if (reservation.status === 'PARTIALLY_RELEASED') {
-    return ok({
-      deltaMinor: reservation.outstandingReservedMinor,
-      cause: 'WRITE_OFF',
-      status: 'WRITTEN_OFF',
-    });
-  }
+  if (reservation.status === 'PARTIALLY_RELEASED') {}
 
   return ok({
killedBy: cancelPolicy writes off a PARTIALLY_RELEASED reservation, returning only what remains reserved
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "WRITE_OFF"
Received: "CANCELLATION"
