[Killed] EqualityOperator
capacity/domain/policies/release.policy.ts:54:7
 ): Result<ReleaseDecision, ReleaseRefusal> {
   const { releaseMinor, releaseCurrency, reservation, scaledRate } = input;
 
-  if (releaseMinor <= 0n) {
+  if (releaseMinor < 0n) {
     return err('INVALID_AMOUNT');
   }
killedBy: releasePolicy refuses a zero or negative release amount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "INVALID_AMOUNT"
Received: "AMOUNT_ROUNDS_TO_ZERO"

[Killed] BlockStatement
capacity/domain/policies/release.policy.ts:54:27
 ): Result<ReleaseDecision, ReleaseRefusal> {
   const { releaseMinor, releaseCurrency, reservation, scaledRate } = input;
 
-  if (releaseMinor <= 0n) {
-    return err('INVALID_AMOUNT');
-  }
+  if (releaseMinor <= 0n) {}
 
   if (releaseCurrency !== reservation.invoiceCurrency) {
killedBy: releasePolicy refuses a zero or negative release amount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "INVALID_AMOUNT"
Received: "AMOUNT_ROUNDS_TO_ZERO"

[Killed] ConditionalExpression
capacity/domain/policies/release.policy.ts:58:7
     return err('INVALID_AMOUNT');
   }
 
-  if (releaseCurrency !== reservation.invoiceCurrency) {
+  if (false) {
     return err('CURRENCY_MISMATCH');
   }
killedBy: releasePolicy refuses a release denominated in any currency but the invoice currency
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
capacity/domain/policies/release.policy.ts:58:7
     return err('INVALID_AMOUNT');
   }
 
-  if (releaseCurrency !== reservation.invoiceCurrency) {
+  if (releaseCurrency === reservation.invoiceCurrency) {
     return err('CURRENCY_MISMATCH');
   }
killedBy: releasePolicy snaps a full repayment to the reserved remainder even when the conversion rounds off by one
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
capacity/domain/policies/release.policy.ts:62:7
     return err('CURRENCY_MISMATCH');
   }
 
-  if (TERMINAL_STATUSES.has(reservation.status)) {
+  if (false) {
     return err('RESERVATION_TERMINAL');
   }
killedBy: releasePolicy refuses a reservation already in terminal status FULLY_RELEASED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
capacity/domain/policies/release.policy.ts:62:50
     return err('CURRENCY_MISMATCH');
   }
 
-  if (TERMINAL_STATUSES.has(reservation.status)) {
-    return err('RESERVATION_TERMINAL');
-  }
+  if (TERMINAL_STATUSES.has(reservation.status)) {}
 
   // A release can never exceed what remains on the invoice. Without this a
killedBy: releasePolicy refuses a reservation already in terminal status FULLY_RELEASED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
capacity/domain/policies/release.policy.ts:70:7
   // sub-1 rate could convert a release that is larger than the outstanding
   // invoice into a delta within the reserved remainder, driving the invoice
   // outstanding negative.
-  if (releaseMinor > reservation.outstandingInvoiceMinor) {
+  if (releaseMinor <= reservation.outstandingInvoiceMinor) {
     return err('RELEASE_EXCEEDS_RESERVED');
   }
killedBy: releasePolicy snaps a full repayment to the reserved remainder even when the conversion rounds off by one
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
capacity/domain/policies/release.policy.ts:70:59
   // sub-1 rate could convert a release that is larger than the outstanding
   // invoice into a delta within the reserved remainder, driving the invoice
   // outstanding negative.
-  if (releaseMinor > reservation.outstandingInvoiceMinor) {
-    return err('RELEASE_EXCEEDS_RESERVED');
-  }
+  if (releaseMinor > reservation.outstandingInvoiceMinor) {}
 
   // A release whose own converted value is below one minor unit returns no
killedBy: releasePolicy refuses a release larger than the outstanding invoice instead of driving it negative
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
capacity/domain/policies/release.policy.ts:81:7
     reservation.programCurrency,
     scaledRate,
   );
-  if (releaseConversion.kind === 'roundsToZero') {
+  if (releaseConversion.kind !== 'roundsToZero') {
     return err('AMOUNT_ROUNDS_TO_ZERO');
   }
killedBy: releasePolicy snaps a full repayment to the reserved remainder even when the conversion rounds off by one
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ConditionalExpression
capacity/domain/policies/release.policy.ts:81:7
     reservation.programCurrency,
     scaledRate,
   );
-  if (releaseConversion.kind === 'roundsToZero') {
+  if (false) {
     return err('AMOUNT_ROUNDS_TO_ZERO');
   }

[Killed] ArithmeticOperator
capacity/domain/policies/release.policy.ts:92:5
   // * rate)` true at every step, so a sub-1 rate cannot drain the reserved
   // remainder ahead of the invoice and strand it short of FULLY_RELEASED.
   const outstandingInvoiceMinor =
-    reservation.outstandingInvoiceMinor - releaseMinor;
+    reservation.outstandingInvoiceMinor + releaseMinor;
   const remainderConversion = convert(
     money(outstandingInvoiceMinor, reservation.programCurrency),
killedBy: releasePolicy snaps a full repayment to the reserved remainder even when the conversion rounds off by one
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
capacity/domain/policies/release.policy.ts:103:5
       ? remainderConversion.amount.minor
       : 0n;
   const deltaMinor =
-    reservation.outstandingReservedMinor - remainderReservedMinor;
+    reservation.outstandingReservedMinor + remainderReservedMinor;
 
   // An inconsistent reservation (its reserved is below the converted invoice)
killedBy: releasePolicy refuses an inconsistent reservation whose reserved is below its converted invoice
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
capacity/domain/policies/release.policy.ts:107:7
 
   // An inconsistent reservation (its reserved is below the converted invoice)
   // is refused rather than clamped.
-  if (deltaMinor < 0n) {
+  if (false) {
     return err('RELEASE_EXCEEDS_RESERVED');
   }
killedBy: releasePolicy refuses an inconsistent reservation whose reserved is below its converted invoice
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
capacity/domain/policies/release.policy.ts:107:7
 
   // An inconsistent reservation (its reserved is below the converted invoice)
   // is refused rather than clamped.
-  if (deltaMinor < 0n) {
+  if (true) {
     return err('RELEASE_EXCEEDS_RESERVED');
   }
killedBy: releasePolicy snaps a full repayment to the reserved remainder even when the conversion rounds off by one
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
capacity/domain/policies/release.policy.ts:112:7
   }
 
   // The release moves no capacity, so it would shrink the invoice for free.
-  if (deltaMinor === 0n) {
+  if (true) {
     return err('AMOUNT_ROUNDS_TO_ZERO');
   }
killedBy: releasePolicy snaps a full repayment to the reserved remainder even when the conversion rounds off by one
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
capacity/domain/policies/release.policy.ts:112:26
   }
 
   // The release moves no capacity, so it would shrink the invoice for free.
-  if (deltaMinor === 0n) {
-    return err('AMOUNT_ROUNDS_TO_ZERO');
-  }
+  if (deltaMinor === 0n) {}
 
   // FR-009b: a remainder worth less than one minor unit is sub-unit dust and is
killedBy: releasePolicy refuses a release that would return no capacity even when the invoice shrinks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
capacity/domain/policies/release.policy.ts:119:7
   // FR-009b: a remainder worth less than one minor unit is sub-unit dust and is
   // settled in full, so the reservation is not left stranded below
   // FULLY_RELEASED with unreleasable capacity.
-  if (remainderReservedMinor === 0n) {
+  if (true) {
     return ok({
       deltaMinor,
killedBy: releasePolicy keeps outstandingReserved equal to the converted outstanding invoice after a partial release
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 600n
Received: 0n

[Killed] ConditionalExpression
capacity/domain/policies/release.policy.ts:119:7
   // FR-009b: a remainder worth less than one minor unit is sub-unit dust and is
   // settled in full, so the reservation is not left stranded below
   // FULLY_RELEASED with unreleasable capacity.
-  if (remainderReservedMinor === 0n) {
+  if (false) {
     return ok({
       deltaMinor,
killedBy: releasePolicy settles a remainder worth less than one minor unit as sub-unit dust
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0n
Received: 1n

[Killed] ConditionalExpression
capacity/domain/policies/release.policy.ts:133:7
     outstandingInvoiceMinor,
     outstandingReservedMinor: remainderReservedMinor,
     status:
-      outstandingInvoiceMinor === 0n ? 'FULLY_RELEASED' : 'PARTIALLY_RELEASED',
+      true ? 'FULLY_RELEASED' : 'PARTIALLY_RELEASED',
   });
 }
killedBy: releasePolicy decreases both outstandings by their respective amounts on a partial release
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PARTIALLY_RELEASED"
Received: "FULLY_RELEASED"

[Killed] EqualityOperator
capacity/domain/policies/release.policy.ts:133:7
     outstandingInvoiceMinor,
     outstandingReservedMinor: remainderReservedMinor,
     status:
-      outstandingInvoiceMinor === 0n ? 'FULLY_RELEASED' : 'PARTIALLY_RELEASED',
+      outstandingInvoiceMinor !== 0n ? 'FULLY_RELEASED' : 'PARTIALLY_RELEASED',
   });
 }
killedBy: releasePolicy decreases both outstandings by their respective amounts on a partial release
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PARTIALLY_RELEASED"
Received: "FULLY_RELEASED"
