[Killed] EqualityOperator
capacity/domain/policies/reserve.policy.ts:30:7
 }): ReserveDecision {
   const { program, invoiceAmountMinor, fx } = input;
 
-  if (program.positionVerified === false) {
+  if (program.positionVerified !== false) {
     return { kind: 'refused', code: 'POSITION_UNVERIFIED' };
   }
killedBy: decideReservation refuses an unverified program even with ample capacity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "refused"
Received: "accepted"

[Killed] BooleanLiteral
capacity/domain/policies/reserve.policy.ts:30:36
 }): ReserveDecision {
   const { program, invoiceAmountMinor, fx } = input;
 
-  if (program.positionVerified === false) {
+  if (program.positionVerified === true) {
     return { kind: 'refused', code: 'POSITION_UNVERIFIED' };
   }
killedBy: decideReservation refuses an unverified program even with ample capacity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "refused"
Received: "accepted"

[Killed] ConditionalExpression
capacity/domain/policies/reserve.policy.ts:34:7
     return { kind: 'refused', code: 'POSITION_UNVERIFIED' };
   }
 
-  if (isOverLimit(program)) {
+  if (false) {
     return { kind: 'refused', code: 'PROGRAM_OVER_LIMIT' };
   }
killedBy: decideReservation refuses a verified over-limit program with nominal room
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PROGRAM_OVER_LIMIT"
Received: "INSUFFICIENT_CAPACITY"

[Killed] BlockStatement
capacity/domain/policies/reserve.policy.ts:34:29
     return { kind: 'refused', code: 'POSITION_UNVERIFIED' };
   }
 
-  if (isOverLimit(program)) {
-    return { kind: 'refused', code: 'PROGRAM_OVER_LIMIT' };
-  }
+  if (isOverLimit(program)) {}
 
   if (fx.kind === 'unavailable') {
killedBy: decideReservation refuses a verified over-limit program with nominal room
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PROGRAM_OVER_LIMIT"
Received: "INSUFFICIENT_CAPACITY"

[Killed] EqualityOperator
capacity/domain/policies/reserve.policy.ts:65:7
 
   const availableMinor = available(program);
 
-  if (reservedMinor > availableMinor) {
+  if (reservedMinor >= availableMinor) {
     return {
       kind: 'refused',
killedBy: decideReservation accepts a request exactly equal to available
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "accepted"
Received: "refused"

[Killed] BlockStatement
capacity/domain/policies/reserve.policy.ts:65:39
 
   const availableMinor = available(program);
 
-  if (reservedMinor > availableMinor) {
-    return {
-      kind: 'refused',
-      code: 'INSUFFICIENT_CAPACITY',
-      details: {
-        requestedMinor: reservedMinor.toString(),
-        availableMinor: availableMinor.toString(),
-      },
-    };
-  }
+  if (reservedMinor > availableMinor) {}
 
   return { kind: 'accepted', reservedMinor, fx: acceptedFx };
killedBy: decideReservation refuses a request one minor unit above available, with details
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "refused"
Received: "accepted"

[Killed] ObjectLiteral
capacity/domain/policies/reserve.policy.ts:69:16
     return {
       kind: 'refused',
       code: 'INSUFFICIENT_CAPACITY',
-      details: {
-        requestedMinor: reservedMinor.toString(),
-        availableMinor: availableMinor.toString(),
-      },
+      details: {},
     };
   }
killedBy: decideReservation refuses a request one minor unit above available, with details
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "availableMinor": "1000",
-   "requestedMinor": "1001",
