[Killed] BlockStatement
src/capacity/domain/position.ts:24:34
 
   const sequenced: SequencedLedgerEntry[] = [];
 
-  for (const pending of entries) {
-    const sequence = nextSequence;
-    nextSequence = nextSequence + 1n;
-
-    switch (pending.component) {
-      case 'LOCAL':
-        localReservedMinor = localReservedMinor + pending.deltaMinor;
-        break;
-      case 'TREASURY':
-        treasuryReservedMinor = treasuryReservedMinor + pending.deltaMinor;
-        break;
-      case 'LIMIT':
-        creditLimitMinor = creditLimitMinor + pending.deltaMinor;
-        break;
-    }
-
-    sequenced.push({ ...pending, sequence });
-  }
+  for (const pending of entries) {}
 
   const wasOverLimit = program.overLimitSince !== null;
killedBy: advancePosition advances each component cache by the sum of its entries
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 70n
Received: 0n

[Killed] ArithmeticOperator
src/capacity/domain/position.ts:26:20
 
   for (const pending of entries) {
     const sequence = nextSequence;
-    nextSequence = nextSequence + 1n;
+    nextSequence = nextSequence - 1n;
 
     switch (pending.component) {
killedBy: advancePosition assigns gapless sequences starting from nextSequence
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    7n,
-   8n,

[Killed] ConditionalExpression
src/capacity/domain/position.ts:29:7
     nextSequence = nextSequence + 1n;
 
     switch (pending.component) {
-      case 'LOCAL':
-        localReservedMinor = localReservedMinor + pending.deltaMinor;
-        break;
+      case 'LOCAL':
       case 'TREASURY':
         treasuryReservedMinor = treasuryReservedMinor + pending.deltaMinor;
killedBy: advancePosition advances each component cache by the sum of its entries
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 70n
Received: 0n

[Killed] ArithmeticOperator
src/capacity/domain/position.ts:30:30
 
     switch (pending.component) {
       case 'LOCAL':
-        localReservedMinor = localReservedMinor + pending.deltaMinor;
+        localReservedMinor = localReservedMinor - pending.deltaMinor;
         break;
       case 'TREASURY':
killedBy: advancePosition advances each component cache by the sum of its entries
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 70n
Received: -70n

[Killed] ConditionalExpression
src/capacity/domain/position.ts:32:7
       case 'LOCAL':
         localReservedMinor = localReservedMinor + pending.deltaMinor;
         break;
-      case 'TREASURY':
-        treasuryReservedMinor = treasuryReservedMinor + pending.deltaMinor;
-        break;
+      case 'TREASURY':
       case 'LIMIT':
         creditLimitMinor = creditLimitMinor + pending.deltaMinor;
killedBy: advancePosition advances each component cache by the sum of its entries
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50n
Received: 0n

[Killed] ArithmeticOperator
src/capacity/domain/position.ts:33:33
         localReservedMinor = localReservedMinor + pending.deltaMinor;
         break;
       case 'TREASURY':
-        treasuryReservedMinor = treasuryReservedMinor + pending.deltaMinor;
+        treasuryReservedMinor = treasuryReservedMinor - pending.deltaMinor;
         break;
       case 'LIMIT':
killedBy: advancePosition advances each component cache by the sum of its entries
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50n
Received: -50n

[Killed] ConditionalExpression
src/capacity/domain/position.ts:35:7
       case 'TREASURY':
         treasuryReservedMinor = treasuryReservedMinor + pending.deltaMinor;
         break;
-      case 'LIMIT':
-        creditLimitMinor = creditLimitMinor + pending.deltaMinor;
-        break;
+      case 'LIMIT':
     }
 
killedBy: advancePosition advances each component cache by the sum of its entries
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1000n
Received: 0n

[Killed] ArithmeticOperator
src/capacity/domain/position.ts:36:28
         treasuryReservedMinor = treasuryReservedMinor + pending.deltaMinor;
         break;
       case 'LIMIT':
-        creditLimitMinor = creditLimitMinor + pending.deltaMinor;
+        creditLimitMinor = creditLimitMinor - pending.deltaMinor;
         break;
     }
killedBy: advancePosition advances each component cache by the sum of its entries
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1000n
Received: -1000n

[Killed] ConditionalExpression
src/capacity/domain/position.ts:43:24
     sequenced.push({ ...pending, sequence });
   }
 
-  const wasOverLimit = program.overLimitSince !== null;
+  const wasOverLimit = false;
   const nowOverLimit =
     localReservedMinor + treasuryReservedMinor > creditLimitMinor;
killedBy: advancePosition clears the mark by release and emits OVER_LIMIT_CLEARED
statusReason: Error: expect(received).toBeNull()

Received: 2026-09-19T12:00:00.000Z

[Killed] ConditionalExpression
src/capacity/domain/position.ts:43:24
     sequenced.push({ ...pending, sequence });
   }
 
-  const wasOverLimit = program.overLimitSince !== null;
+  const wasOverLimit = true;
   const nowOverLimit =
     localReservedMinor + treasuryReservedMinor > creditLimitMinor;
killedBy: advancePosition assigns gapless sequences starting from nextSequence
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    7n,
    8n,

[Killed] ConditionalExpression
src/capacity/domain/position.ts:45:5
 
   const wasOverLimit = program.overLimitSince !== null;
   const nowOverLimit =
-    localReservedMinor + treasuryReservedMinor > creditLimitMinor;
+    true;
 
   const lastEntry =
killedBy: advancePosition assigns gapless sequences starting from nextSequence
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    7n,
    8n,

[Killed] ArithmeticOperator
src/capacity/domain/position.ts:45:5
 
   const wasOverLimit = program.overLimitSince !== null;
   const nowOverLimit =
-    localReservedMinor + treasuryReservedMinor > creditLimitMinor;
+    localReservedMinor - treasuryReservedMinor > creditLimitMinor;
 
   const lastEntry =
killedBy: advancePosition accepts treasury reservations that push the total over the limit
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2026-09-19T12:00:00.000Z
Received: null

[Killed] ArithmeticOperator
src/capacity/domain/position.ts:48:34
     localReservedMinor + treasuryReservedMinor > creditLimitMinor;
 
   const lastEntry =
-    entries.length > 0 ? entries[entries.length - 1] : undefined;
+    entries.length > 0 ? entries[entries.length + 1] : undefined;
   const correlationId = lastEntry === undefined ? 'system' : lastEntry.correlationId;
 
killedBy: advancePosition copies the correlationId of the last input entry onto the marker
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "last"
Received: "system"

[Killed] ConditionalExpression
src/capacity/domain/position.ts:48:5
     localReservedMinor + treasuryReservedMinor > creditLimitMinor;
 
   const lastEntry =
-    entries.length > 0 ? entries[entries.length - 1] : undefined;
+    false ? entries[entries.length - 1] : undefined;
   const correlationId = lastEntry === undefined ? 'system' : lastEntry.correlationId;
 
killedBy: advancePosition copies the correlationId of the last input entry onto the marker
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "last"
Received: "system"

[Killed] BlockStatement
src/capacity/domain/position.ts:53:38
 
   let overLimitSince = program.overLimitSince;
 
-  if (!wasOverLimit && nowOverLimit) {
-    sequenced.push({
-      deltaMinor: 0n,
-      component: 'LIMIT',
-      cause: 'OVER_LIMIT_ONSET',
-      originReference: null,
-      actor: 'system',
-      correlationId,
-      sequence: nextSequence,
-    });
-    nextSequence = nextSequence + 1n;
-    overLimitSince = now;
-  } else if (wasOverLimit && !nowOverLimit) {
+  if (!wasOverLimit && nowOverLimit) {} else if (wasOverLimit && !nowOverLimit) {
     sequenced.push({
       deltaMinor: 0n,
killedBy: advancePosition sets the over-limit mark and emits OVER_LIMIT_ONSET on onset
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2026-09-19T12:00:00.000Z
Received: null

[Killed] LogicalOperator
src/capacity/domain/position.ts:53:7
 
   let overLimitSince = program.overLimitSince;
 
-  if (!wasOverLimit && nowOverLimit) {
+  if (!wasOverLimit || nowOverLimit) {
     sequenced.push({
       deltaMinor: 0n,
killedBy: advancePosition assigns gapless sequences starting from nextSequence
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    7n,
    8n,

[Survived] StringLiteral
src/capacity/domain/position.ts:59:14
       component: 'LIMIT',
       cause: 'OVER_LIMIT_ONSET',
       originReference: null,
-      actor: 'system',
+      actor: "",
       correlationId,
       sequence: nextSequence,

[Killed] ArithmeticOperator
src/capacity/domain/position.ts:63:20
       correlationId,
       sequence: nextSequence,
     });
-    nextSequence = nextSequence + 1n;
+    nextSequence = nextSequence - 1n;
     overLimitSince = now;
   } else if (wasOverLimit && !nowOverLimit) {
killedBy: advancePosition accounts for marker entries in nextSequence
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3n
Received: 1n

[Killed] BooleanLiteral
src/capacity/domain/position.ts:65:30
     });
     nextSequence = nextSequence + 1n;
     overLimitSince = now;
-  } else if (wasOverLimit && !nowOverLimit) {
+  } else if (wasOverLimit && nowOverLimit) {
     sequenced.push({
       deltaMinor: 0n,
killedBy: advancePosition clears the mark by release and emits OVER_LIMIT_CLEARED
statusReason: Error: expect(received).toBeNull()

Received: 2026-09-19T12:00:00.000Z

[Killed] BlockStatement
src/capacity/domain/position.ts:65:45
     });
     nextSequence = nextSequence + 1n;
     overLimitSince = now;
-  } else if (wasOverLimit && !nowOverLimit) {
-    sequenced.push({
-      deltaMinor: 0n,
-      component: 'LIMIT',
-      cause: 'OVER_LIMIT_CLEARED',
-      originReference: null,
-      actor: 'system',
-      correlationId,
-      sequence: nextSequence,
-    });
-    nextSequence = nextSequence + 1n;
-    overLimitSince = null;
-  }
+  } else if (wasOverLimit && !nowOverLimit) {}
 
   return {
killedBy: advancePosition clears the mark by release and emits OVER_LIMIT_CLEARED
statusReason: Error: expect(received).toBeNull()

Received: 2026-09-19T12:00:00.000Z
