[Killed] ArithmeticOperator
src/capacity/domain/program.ts:14:10
 }
 
 export function totalReserved(p: ProgramPosition): bigint {
-  return p.localReservedMinor + p.treasuryReservedMinor;
+  return p.localReservedMinor - p.treasuryReservedMinor;
 }
 
killedBy: program position helpers sums local and treasury into totalReserved
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 120n
Received: 20n

[Killed] ArithmeticOperator
src/capacity/domain/program.ts:18:10
 }
 
 export function available(p: ProgramPosition): bigint {
-  return p.creditLimitMinor - totalReserved(p);
+  return p.creditLimitMinor + totalReserved(p);
 }
 
killedBy: program position helpers returns a signed available that is never floored
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -200n
Received: 2200n

[Killed] EqualityOperator
src/capacity/domain/program.ts:22:10
 }
 
 export function isOverLimit(p: ProgramPosition): boolean {
-  return totalReserved(p) > p.creditLimitMinor;
+  return totalReserved(p) <= p.creditLimitMinor;
 }
 
killedBy: decideReservation refuses a verified over-limit program with nominal room
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PROGRAM_OVER_LIMIT"
Received: "INSUFFICIENT_CAPACITY"

[Killed] ConditionalExpression
src/capacity/domain/program.ts:22:10
 }
 
 export function isOverLimit(p: ProgramPosition): boolean {
-  return totalReserved(p) > p.creditLimitMinor;
+  return false;
 }
 
killedBy: decideReservation refuses a verified over-limit program with nominal room
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PROGRAM_OVER_LIMIT"
Received: "INSUFFICIENT_CAPACITY"
