[Killed] BooleanLiteral
src/shared/money/convert.ts:6:7
 export const RATE_SCALE = 10n ** 10n;
 
 export function scaleRate(rate: string): bigint {
-  if (!/^\d{1,10}(\.\d{1,10})?$/.test(rate)) {
+  if (/^\d{1,10}(\.\d{1,10})?$/.test(rate)) {
     throw new TypeError(`invalid rate: ${rate}`);
   }
killedBy: decideReservation refuses an amount that rounds to zero
statusReason: TypeError: invalid rate: 0.0067

[Killed] BlockStatement
src/shared/money/convert.ts:6:46
 export const RATE_SCALE = 10n ** 10n;
 
 export function scaleRate(rate: string): bigint {
-  if (!/^\d{1,10}(\.\d{1,10})?$/.test(rate)) {
-    throw new TypeError(`invalid rate: ${rate}`);
-  }
+  if (!/^\d{1,10}(\.\d{1,10})?$/.test(rate)) {}
 
   const dot = rate.indexOf('.');
killedBy: scaleRate rejects more than ten fractional digits
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/shared/money/convert.ts:11:19
   }
 
   const dot = rate.indexOf('.');
-  const intPart = dot === -1 ? rate : rate.slice(0, dot);
+  const intPart = true ? rate : rate.slice(0, dot);
   const fracPart = dot === -1 ? '' : rate.slice(dot + 1);
   const scaled = BigInt(intPart + fracPart.padEnd(10, '0'));
killedBy: scaleRate scales decimal rates with ten fractional digits
statusReason: SyntaxError: Cannot convert 1.08500000000850000000 to a BigInt

[Killed] UnaryOperator
src/shared/money/convert.ts:11:27
   }
 
   const dot = rate.indexOf('.');
-  const intPart = dot === -1 ? rate : rate.slice(0, dot);
+  const intPart = dot === +1 ? rate : rate.slice(0, dot);
   const fracPart = dot === -1 ? '' : rate.slice(dot + 1);
   const scaled = BigInt(intPart + fracPart.padEnd(10, '0'));
killedBy: scaleRate scales decimal rates with ten fractional digits
statusReason: SyntaxError: Cannot convert 1.08500000000850000000 to a BigInt

[Killed] ArithmeticOperator
src/shared/money/convert.ts:12:49
 
   const dot = rate.indexOf('.');
   const intPart = dot === -1 ? rate : rate.slice(0, dot);
-  const fracPart = dot === -1 ? '' : rate.slice(dot + 1);
+  const fracPart = dot === -1 ? '' : rate.slice(dot - 1);
   const scaled = BigInt(intPart + fracPart.padEnd(10, '0'));
 
killedBy: scaleRate scales decimal rates with ten fractional digits
statusReason: SyntaxError: Cannot convert 11.0850000000 to a BigInt

[Killed] ConditionalExpression
src/shared/money/convert.ts:12:20
 
   const dot = rate.indexOf('.');
   const intPart = dot === -1 ? rate : rate.slice(0, dot);
-  const fracPart = dot === -1 ? '' : rate.slice(dot + 1);
+  const fracPart = true ? '' : rate.slice(dot + 1);
   const scaled = BigInt(intPart + fracPart.padEnd(10, '0'));
 
killedBy: scaleRate scales decimal rates with ten fractional digits
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10850000000n
Received: 10000000000n

[Killed] ConditionalExpression
src/shared/money/convert.ts:15:7
   const fracPart = dot === -1 ? '' : rate.slice(dot + 1);
   const scaled = BigInt(intPart + fracPart.padEnd(10, '0'));
 
-  if (scaled === 0n) {
+  if (true) {
     throw new TypeError('rate must not be zero');
   }
killedBy: releasePolicy snaps a full repayment to the reserved remainder even when the conversion rounds off by one
statusReason: TypeError: rate must not be zero

[Killed] BlockStatement
src/shared/money/convert.ts:15:22
   const fracPart = dot === -1 ? '' : rate.slice(dot + 1);
   const scaled = BigInt(intPart + fracPart.padEnd(10, '0'));
 
-  if (scaled === 0n) {
-    throw new TypeError('rate must not be zero');
-  }
+  if (scaled === 0n) {}
 
   return scaled;
killedBy: scaleRate rejects a zero rate
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] EqualityOperator
src/shared/money/convert.ts:23:7
 }
 
 export function roundHalfUp(numerator: bigint, denominator: bigint): bigint {
-  if (denominator <= 0n) {
+  if (denominator > 0n) {
     throw new TypeError('denominator must be positive');
   }
killedBy: roundHalfUp rounds halves away from zero for both signs
statusReason: TypeError: denominator must be positive

[Killed] ConditionalExpression
src/shared/money/convert.ts:23:7
 }
 
 export function roundHalfUp(numerator: bigint, denominator: bigint): bigint {
-  if (denominator <= 0n) {
+  if (true) {
     throw new TypeError('denominator must be positive');
   }
killedBy: releasePolicy snaps a full repayment to the reserved remainder even when the conversion rounds off by one
statusReason: TypeError: denominator must be positive

[Killed] ArithmeticOperator
src/shared/money/convert.ts:27:20
     throw new TypeError('denominator must be positive');
   }
 
-  const quotient = numerator / denominator;
+  const quotient = numerator * denominator;
   const remainder = numerator % denominator;
   const absRemainder = remainder < 0n ? -remainder : remainder;
killedBy: roundHalfUp rounds halves away from zero for both signs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1n
Received: 51n

[Killed] ArithmeticOperator
src/shared/money/convert.ts:28:21
   }
 
   const quotient = numerator / denominator;
-  const remainder = numerator % denominator;
+  const remainder = numerator * denominator;
   const absRemainder = remainder < 0n ? -remainder : remainder;
 
killedBy: releasePolicy settles a remainder worth less than one minor unit as sub-unit dust
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/shared/money/convert.ts:29:24
 
   const quotient = numerator / denominator;
   const remainder = numerator % denominator;
-  const absRemainder = remainder < 0n ? -remainder : remainder;
+  const absRemainder = true ? -remainder : remainder;
 
   if (2n * absRemainder >= denominator) {
killedBy: releasePolicy settles a remainder worth less than one minor unit as sub-unit dust
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/shared/money/convert.ts:29:24
 
   const quotient = numerator / denominator;
   const remainder = numerator % denominator;
-  const absRemainder = remainder < 0n ? -remainder : remainder;
+  const absRemainder = remainder >= 0n ? -remainder : remainder;
 
   if (2n * absRemainder >= denominator) {
killedBy: releasePolicy settles a remainder worth less than one minor unit as sub-unit dust
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/shared/money/convert.ts:31:7
   const remainder = numerator % denominator;
   const absRemainder = remainder < 0n ? -remainder : remainder;
 
-  if (2n * absRemainder >= denominator) {
+  if (2n * absRemainder < denominator) {
     return numerator < 0n ? quotient - 1n : quotient + 1n;
   }
killedBy: releasePolicy snaps a full repayment to the reserved remainder even when the conversion rounds off by one
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 110n
Received: 109n

[Killed] ConditionalExpression
src/shared/money/convert.ts:31:7
   const remainder = numerator % denominator;
   const absRemainder = remainder < 0n ? -remainder : remainder;
 
-  if (2n * absRemainder >= denominator) {
+  if (false) {
     return numerator < 0n ? quotient - 1n : quotient + 1n;
   }
killedBy: releasePolicy settles a remainder worth less than one minor unit as sub-unit dust
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/shared/money/convert.ts:32:29
   const absRemainder = remainder < 0n ? -remainder : remainder;
 
   if (2n * absRemainder >= denominator) {
-    return numerator < 0n ? quotient - 1n : quotient + 1n;
+    return numerator < 0n ? quotient + 1n : quotient + 1n;
   }
 
killedBy: roundHalfUp rounds halves away from zero for both signs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -1n
Received: 1n

[Killed] ConditionalExpression
src/shared/money/convert.ts:32:12
   const absRemainder = remainder < 0n ? -remainder : remainder;
 
   if (2n * absRemainder >= denominator) {
-    return numerator < 0n ? quotient - 1n : quotient + 1n;
+    return false ? quotient - 1n : quotient + 1n;
   }
 
killedBy: roundHalfUp rounds halves away from zero for both signs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -1n
Received: 1n

[Killed] ArithmeticOperator
src/shared/money/convert.ts:47:30
   targetCurrency: string,
   scaledRate: bigint,
 ): ConversionOutcome {
-  const result = roundHalfUp(amount.minor * scaledRate, RATE_SCALE);
+  const result = roundHalfUp(amount.minor / scaledRate, RATE_SCALE);
 
   if (result === 0n && amount.minor !== 0n) {
killedBy: convert converts an amount at the scaled rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "converted"
Received: "roundsToZero"

[Killed] EqualityOperator
src/shared/money/convert.ts:49:7
 ): ConversionOutcome {
   const result = roundHalfUp(amount.minor * scaledRate, RATE_SCALE);
 
-  if (result === 0n && amount.minor !== 0n) {
+  if (result !== 0n && amount.minor !== 0n) {
     return { kind: 'roundsToZero' };
   }
killedBy: convert reports a non-zero amount that rounds to zero
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 5

  Object {
-   "kind": "roundsToZero",
+   "amount": Object {

[Killed] ConditionalExpression
src/shared/money/convert.ts:49:7
 ): ConversionOutcome {
   const result = roundHalfUp(amount.minor * scaledRate, RATE_SCALE);
 
-  if (result === 0n && amount.minor !== 0n) {
+  if (true) {
     return { kind: 'roundsToZero' };
   }
killedBy: releasePolicy snaps a full repayment to the reserved remainder even when the conversion rounds off by one
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
