[Killed] StringLiteral
src/shared/money/minor-units.ts:1:31
-const ZERO_DECIMAL = new Set(['JPY', 'KRW', 'VND', 'CLP', 'ISK', 'XOF', 'XAF', 'XPF']);
+const ZERO_DECIMAL = new Set(["", 'KRW', 'VND', 'CLP', 'ISK', 'XOF', 'XAF', 'XPF']);
 const THREE_DECIMAL = new Set(['BHD', 'IQD', 'JOD', 'KWD', 'LYD', 'OMR', 'TND']);
 
killedBy: minorUnitDigits classifies zero, three and two decimal currencies
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Survived] StringLiteral
src/shared/money/minor-units.ts:2:32
 const ZERO_DECIMAL = new Set(['JPY', 'KRW', 'VND', 'CLP', 'ISK', 'XOF', 'XAF', 'XPF']);
-const THREE_DECIMAL = new Set(['BHD', 'IQD', 'JOD', 'KWD', 'LYD', 'OMR', 'TND']);
+const THREE_DECIMAL = new Set(["", 'IQD', 'JOD', 'KWD', 'LYD', 'OMR', 'TND']);
 
 /** ISO-4217 minor unit digits. Defaults to 2, which is correct for the great majority. */

[Survived] StringLiteral
src/shared/money/minor-units.ts:2:74
 const ZERO_DECIMAL = new Set(['JPY', 'KRW', 'VND', 'CLP', 'ISK', 'XOF', 'XAF', 'XPF']);
-const THREE_DECIMAL = new Set(['BHD', 'IQD', 'JOD', 'KWD', 'LYD', 'OMR', 'TND']);
+const THREE_DECIMAL = new Set(['BHD', 'IQD', 'JOD', 'KWD', 'LYD', 'OMR', ""]);
 
 /** ISO-4217 minor unit digits. Defaults to 2, which is correct for the great majority. */

[Killed] ConditionalExpression
src/shared/money/minor-units.ts:6:7
 
 /** ISO-4217 minor unit digits. Defaults to 2, which is correct for the great majority. */
 export function minorUnitDigits(code: string): number {
-  if (ZERO_DECIMAL.has(code)) return 0;
+  if (true) return 0;
   if (THREE_DECIMAL.has(code)) return 3;
   return 2;
killedBy: minorUnitDigits classifies zero, three and two decimal currencies
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] ConditionalExpression
src/shared/money/minor-units.ts:6:7
 
 /** ISO-4217 minor unit digits. Defaults to 2, which is correct for the great majority. */
 export function minorUnitDigits(code: string): number {
-  if (ZERO_DECIMAL.has(code)) return 0;
+  if (false) return 0;
   if (THREE_DECIMAL.has(code)) return 3;
   return 2;
killedBy: minorUnitDigits classifies zero, three and two decimal currencies
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Killed] ConditionalExpression
src/shared/money/minor-units.ts:7:7
 /** ISO-4217 minor unit digits. Defaults to 2, which is correct for the great majority. */
 export function minorUnitDigits(code: string): number {
   if (ZERO_DECIMAL.has(code)) return 0;
-  if (THREE_DECIMAL.has(code)) return 3;
+  if (true) return 3;
   return 2;
 }
killedBy: minorUnitDigits classifies zero, three and two decimal currencies
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] ConditionalExpression
src/shared/money/minor-units.ts:7:7
 /** ISO-4217 minor unit digits. Defaults to 2, which is correct for the great majority. */
 export function minorUnitDigits(code: string): number {
   if (ZERO_DECIMAL.has(code)) return 0;
-  if (THREE_DECIMAL.has(code)) return 3;
+  if (false) return 3;
   return 2;
 }
killedBy: minorUnitDigits classifies zero, three and two decimal currencies
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 2
