[Killed] ConditionalExpression
src/shared/money/money.ts:11:7
 export class CurrencyMismatchError extends Error {}
 
 export function currency(code: string): CurrencyCode {
-  if (!/^[A-Z]{3}$/.test(code)) {
+  if (false) {
     throw new TypeError(`invalid currency code: ${code}`);
   }
killedBy: money rejects malformed currency codes
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/shared/money/money.ts:11:7
 export class CurrencyMismatchError extends Error {}
 
 export function currency(code: string): CurrencyCode {
-  if (!/^[A-Z]{3}$/.test(code)) {
+  if (true) {
     throw new TypeError(`invalid currency code: ${code}`);
   }
killedBy: convert reports a non-zero amount that rounds to zero
statusReason: TypeError: invalid currency code: JPY

[Survived] StringLiteral
src/shared/money/money.ts:12:25
 
 export function currency(code: string): CurrencyCode {
   if (!/^[A-Z]{3}$/.test(code)) {
-    throw new TypeError(`invalid currency code: ${code}`);
+    throw new TypeError(``);
   }
   return code as CurrencyCode;

[Killed] ConditionalExpression
src/shared/money/money.ts:18:7
 }
 
 export function money(minor: bigint, code: string | CurrencyCode): Money {
-  if (typeof minor === 'number') {
+  if (false) {
     throw new TypeError('money() requires bigint minor units, received number');
   }
killedBy: money rejects construction from number
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: TypeError

Received function did not throw

[Killed] ConditionalExpression
src/shared/money/money.ts:18:7
 }
 
 export function money(minor: bigint, code: string | CurrencyCode): Money {
-  if (typeof minor === 'number') {
+  if (true) {
     throw new TypeError('money() requires bigint minor units, received number');
   }
killedBy: releasePolicy snaps a full repayment to the reserved remainder even when the conversion rounds off by one
statusReason: TypeError: money() requires bigint minor units, received number

[Killed] BlockStatement
src/shared/money/money.ts:24:55
   return { minor, currency: currency(code) };
 }
 
-function assertSameCurrency(a: Money, b: Money): void {
-  if (a.currency !== b.currency) {
-    throw new CurrencyMismatchError(
-      `currency mismatch: ${a.currency} !== ${b.currency}`,
-    );
-  }
-}
+function assertSameCurrency(a: Money, b: Money): void {}
 
 export function add(a: Money, b: Money): Money {
killedBy: money rejects arithmetic across currencies
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: CurrencyMismatchError

Received function did not throw

[Killed] EqualityOperator
src/shared/money/money.ts:25:7
 }
 
 function assertSameCurrency(a: Money, b: Money): void {
-  if (a.currency !== b.currency) {
+  if (a.currency === b.currency) {
     throw new CurrencyMismatchError(
       `currency mismatch: ${a.currency} !== ${b.currency}`,
killedBy: money rejects arithmetic across currencies
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: CurrencyMismatchError

Received function did not throw

[Killed] ConditionalExpression
src/shared/money/money.ts:25:7
 }
 
 function assertSameCurrency(a: Money, b: Money): void {
-  if (a.currency !== b.currency) {
+  if (true) {
     throw new CurrencyMismatchError(
       `currency mismatch: ${a.currency} !== ${b.currency}`,
killedBy: money returns a new object without mutating operands
statusReason: Error: currency mismatch: USD !== USD

[Killed] CallExpression
src/shared/money/money.ts:33:3
 }
 
 export function add(a: Money, b: Money): Money {
-  assertSameCurrency(a, b);
+  ;
   return { minor: a.minor + b.minor, currency: a.currency };
 }
killedBy: money rejects arithmetic across currencies
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: CurrencyMismatchError

Received function did not throw

[Killed] ArithmeticOperator
src/shared/money/money.ts:34:19
 
 export function add(a: Money, b: Money): Money {
   assertSameCurrency(a, b);
-  return { minor: a.minor + b.minor, currency: a.currency };
+  return { minor: a.minor - b.minor, currency: a.currency };
 }
 
killedBy: money returns a new object without mutating operands
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 350n
Received: -150n

[Killed] CallExpression
src/shared/money/money.ts:38:3
 }
 
 export function subtract(a: Money, b: Money): Money {
-  assertSameCurrency(a, b);
+  ;
   return { minor: a.minor - b.minor, currency: a.currency };
 }
killedBy: money arithmetic and ordering subtracts same-currency amounts and rejects a mismatch
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: CurrencyMismatchError

Received function did not throw

[Killed] ArithmeticOperator
src/shared/money/money.ts:39:19
 
 export function subtract(a: Money, b: Money): Money {
   assertSameCurrency(a, b);
-  return { minor: a.minor - b.minor, currency: a.currency };
+  return { minor: a.minor + b.minor, currency: a.currency };
 }
 
killedBy: money arithmetic and ordering subtracts same-currency amounts and rejects a mismatch
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "currency": "USD",
-   "minor": 150n,

[Killed] ConditionalExpression
src/shared/money/money.ts:47:10
 }
 
 export function isZero(a: Money): boolean {
-  return a.minor === 0n;
+  return false;
 }
 
killedBy: money arithmetic and ordering detects zero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/shared/money/money.ts:47:10
 }
 
 export function isZero(a: Money): boolean {
-  return a.minor === 0n;
+  return true;
 }
 
killedBy: money arithmetic and ordering detects zero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] CallExpression
src/shared/money/money.ts:51:3
 }
 
 export function compare(a: Money, b: Money): -1 | 0 | 1 {
-  assertSameCurrency(a, b);
+  ;
   if (a.minor < b.minor) {
     return -1;
killedBy: money arithmetic and ordering orders same-currency amounts and rejects a mismatch
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: CurrencyMismatchError

Received function did not throw

[Killed] ConditionalExpression
src/shared/money/money.ts:52:7
 
 export function compare(a: Money, b: Money): -1 | 0 | 1 {
   assertSameCurrency(a, b);
-  if (a.minor < b.minor) {
+  if (false) {
     return -1;
   }
killedBy: money arithmetic and ordering orders same-currency amounts and rejects a mismatch
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -1
Received: 0

[Killed] EqualityOperator
src/shared/money/money.ts:52:7
 
 export function compare(a: Money, b: Money): -1 | 0 | 1 {
   assertSameCurrency(a, b);
-  if (a.minor < b.minor) {
+  if (a.minor <= b.minor) {
     return -1;
   }
killedBy: money arithmetic and ordering orders same-currency amounts and rejects a mismatch
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -1

[Killed] UnaryOperator
src/shared/money/money.ts:53:12
 export function compare(a: Money, b: Money): -1 | 0 | 1 {
   assertSameCurrency(a, b);
   if (a.minor < b.minor) {
-    return -1;
+    return +1;
   }
   if (a.minor > b.minor) {
killedBy: money arithmetic and ordering orders same-currency amounts and rejects a mismatch
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -1
Received: 1

[Killed] ConditionalExpression
src/shared/money/money.ts:55:7
   if (a.minor < b.minor) {
     return -1;
   }
-  if (a.minor > b.minor) {
+  if (true) {
     return 1;
   }
killedBy: money arithmetic and ordering orders same-currency amounts and rejects a mismatch
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] EqualityOperator
src/shared/money/money.ts:55:7
   if (a.minor < b.minor) {
     return -1;
   }
-  if (a.minor > b.minor) {
+  if (a.minor >= b.minor) {
     return 1;
   }
killedBy: money arithmetic and ordering orders same-currency amounts and rejects a mismatch
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
src/shared/money/money.ts:62:20
 }
 
 export function toDecimalString(a: Money, minorUnitDigits: number): string {
-  const negative = a.minor < 0n;
+  const negative = true;
   const abs = negative ? -a.minor : a.minor;
   const digits = abs.toString();
killedBy: money round trips one above Number.MAX_SAFE_INTEGER
statusReason: TypeError: invalid decimal string: --90071992547409.93

[Killed] EqualityOperator
src/shared/money/money.ts:62:20
 }
 
 export function toDecimalString(a: Money, minorUnitDigits: number): string {
-  const negative = a.minor < 0n;
+  const negative = a.minor <= 0n;
   const abs = negative ? -a.minor : a.minor;
   const digits = abs.toString();
killedBy: money renders zero minor units
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0.00"
Received: "-0.00"

[Killed] ConditionalExpression
src/shared/money/money.ts:66:7
   const abs = negative ? -a.minor : a.minor;
   const digits = abs.toString();
 
-  if (minorUnitDigits === 0) {
+  if (true) {
     return negative ? `-${digits}` : digits;
   }
killedBy: money round trips one above Number.MAX_SAFE_INTEGER
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "currency": "USD",
-   "minor": 9007199254740993n,

[Killed] BlockStatement
src/shared/money/money.ts:66:30
   const abs = negative ? -a.minor : a.minor;
   const digits = abs.toString();
 
-  if (minorUnitDigits === 0) {
-    return negative ? `-${digits}` : digits;
-  }
+  if (minorUnitDigits === 0) {}
 
   const padded = digits.padStart(minorUnitDigits + 1, '0');
killedBy: money arithmetic and ordering renders whole-unit currencies without a decimal point
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1234"
Received: "1234."

[Killed] ArithmeticOperator
src/shared/money/money.ts:70:34
     return negative ? `-${digits}` : digits;
   }
 
-  const padded = digits.padStart(minorUnitDigits + 1, '0');
+  const padded = digits.padStart(minorUnitDigits - 1, '0');
   const cut = padded.length - minorUnitDigits;
   const whole = padded.slice(0, cut);
killedBy: money renders negative minor units
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "-0.01"
Received: "-.1"

[Killed] StringLiteral
src/shared/money/money.ts:70:55
     return negative ? `-${digits}` : digits;
   }
 
-  const padded = digits.padStart(minorUnitDigits + 1, '0');
+  const padded = digits.padStart(minorUnitDigits + 1, "");
   const cut = padded.length - minorUnitDigits;
   const whole = padded.slice(0, cut);
killedBy: money renders negative minor units
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "-0.01"
Received: "-.1"

[Killed] ArithmeticOperator
src/shared/money/money.ts:71:15
   }
 
   const padded = digits.padStart(minorUnitDigits + 1, '0');
-  const cut = padded.length - minorUnitDigits;
+  const cut = padded.length + minorUnitDigits;
   const whole = padded.slice(0, cut);
   const fraction = padded.slice(cut);
killedBy: money round trips one above Number.MAX_SAFE_INTEGER
statusReason: TypeError: invalid decimal string: 9007199254740993.

[Killed] MethodExpression
src/shared/money/money.ts:72:17
 
   const padded = digits.padStart(minorUnitDigits + 1, '0');
   const cut = padded.length - minorUnitDigits;
-  const whole = padded.slice(0, cut);
+  const whole = padded;
   const fraction = padded.slice(cut);
   const rendered = `${whole}.${fraction}`;
killedBy: money round trips one above Number.MAX_SAFE_INTEGER
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "currency": "USD",
-   "minor": 9007199254740993n,

[Timeout] MethodExpression
src/shared/money/money.ts:73:20
   const padded = digits.padStart(minorUnitDigits + 1, '0');
   const cut = padded.length - minorUnitDigits;
   const whole = padded.slice(0, cut);
-  const fraction = padded.slice(cut);
+  const fraction = padded;
   const rendered = `${whole}.${fraction}`;
   return negative ? `-${rendered}` : rendered;

[Killed] StringLiteral
src/shared/money/money.ts:75:21
   const whole = padded.slice(0, cut);
   const fraction = padded.slice(cut);
   const rendered = `${whole}.${fraction}`;
-  return negative ? `-${rendered}` : rendered;
+  return negative ? `` : rendered;
 }
 
killedBy: money renders negative minor units
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "-0.01"
Received: ""

[Killed] BlockStatement
src/shared/money/money.ts:83:44
   code: string,
   minorUnitDigits: number,
 ): Money {
-  if (!/^-?\d{1,19}(\.\d+)?$/.test(value)) {
-    throw new TypeError(`invalid decimal string: ${value}`);
-  }
+  if (!/^-?\d{1,19}(\.\d+)?$/.test(value)) {}
 
   const negative = value.startsWith('-');
killedBy: money arithmetic and ordering rejects malformed and over-precise decimal strings
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: TypeError
Received constructor: SyntaxError

Received message: "Cannot convert not-a-number00 to a BigInt"

      248 |     const paddedFrac = fracPart.padEnd(minorUnitDigits, stryMutAct_9fa48("1312") ? "" : (stryCov_9fa48("1312"), '0'));

[Killed] ConditionalExpression
src/shared/money/money.ts:83:7
   code: string,
   minorUnitDigits: number,
 ): Money {
-  if (!/^-?\d{1,19}(\.\d+)?$/.test(value)) {
+  if (true) {
     throw new TypeError(`invalid decimal string: ${value}`);
   }
killedBy: money round trips one above Number.MAX_SAFE_INTEGER
statusReason: TypeError: invalid decimal string: 90071992547409.93

[Survived] MethodExpression
src/shared/money/money.ts:87:20
     throw new TypeError(`invalid decimal string: ${value}`);
   }
 
-  const negative = value.startsWith('-');
+  const negative = value.endsWith('-');
   const unsigned = negative ? value.slice(1) : value;
   const dot = unsigned.indexOf('.');

[Killed] MethodExpression
src/shared/money/money.ts:88:31
   }
 
   const negative = value.startsWith('-');
-  const unsigned = negative ? value.slice(1) : value;
+  const unsigned = negative ? value : value;
   const dot = unsigned.indexOf('.');
   const intPart = dot === -1 ? unsigned : unsigned.slice(0, dot);
killedBy: money arithmetic and ordering parses a negative decimal string back to negative minor units
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "currency": "USD",
-   "minor": -1n,

[Killed] ConditionalExpression
src/shared/money/money.ts:90:19
   const negative = value.startsWith('-');
   const unsigned = negative ? value.slice(1) : value;
   const dot = unsigned.indexOf('.');
-  const intPart = dot === -1 ? unsigned : unsigned.slice(0, dot);
+  const intPart = true ? unsigned : unsigned.slice(0, dot);
   const fracPart = dot === -1 ? '' : unsigned.slice(dot + 1);
 
killedBy: money round trips one above Number.MAX_SAFE_INTEGER
statusReason: SyntaxError: Cannot convert 90071992547409.9393 to a BigInt

[Killed] MethodExpression
src/shared/money/money.ts:90:43
   const negative = value.startsWith('-');
   const unsigned = negative ? value.slice(1) : value;
   const dot = unsigned.indexOf('.');
-  const intPart = dot === -1 ? unsigned : unsigned.slice(0, dot);
+  const intPart = dot === -1 ? unsigned : unsigned;
   const fracPart = dot === -1 ? '' : unsigned.slice(dot + 1);
 
killedBy: money round trips one above Number.MAX_SAFE_INTEGER
statusReason: SyntaxError: Cannot convert 90071992547409.9393 to a BigInt

[Killed] ArithmeticOperator
src/shared/money/money.ts:91:53
   const unsigned = negative ? value.slice(1) : value;
   const dot = unsigned.indexOf('.');
   const intPart = dot === -1 ? unsigned : unsigned.slice(0, dot);
-  const fracPart = dot === -1 ? '' : unsigned.slice(dot + 1);
+  const fracPart = dot === -1 ? '' : unsigned.slice(dot - 1);
 
   if (fracPart.length > minorUnitDigits) {
killedBy: money round trips one above Number.MAX_SAFE_INTEGER
statusReason: TypeError: too many fractional digits for 2-minor-unit currency: 90071992547409.93

[Killed] MethodExpression
src/shared/money/money.ts:91:38
   const unsigned = negative ? value.slice(1) : value;
   const dot = unsigned.indexOf('.');
   const intPart = dot === -1 ? unsigned : unsigned.slice(0, dot);
-  const fracPart = dot === -1 ? '' : unsigned.slice(dot + 1);
+  const fracPart = dot === -1 ? '' : unsigned;
 
   if (fracPart.length > minorUnitDigits) {
killedBy: money round trips one above Number.MAX_SAFE_INTEGER
statusReason: TypeError: too many fractional digits for 2-minor-unit currency: 90071992547409.93

[Killed] EqualityOperator
src/shared/money/money.ts:93:7
   const intPart = dot === -1 ? unsigned : unsigned.slice(0, dot);
   const fracPart = dot === -1 ? '' : unsigned.slice(dot + 1);
 
-  if (fracPart.length > minorUnitDigits) {
+  if (fracPart.length <= minorUnitDigits) {
     throw new TypeError(
       `too many fractional digits for ${minorUnitDigits}-minor-unit currency: ${value}`,
killedBy: money round trips one above Number.MAX_SAFE_INTEGER
statusReason: TypeError: too many fractional digits for 2-minor-unit currency: 90071992547409.93

[Killed] ConditionalExpression
src/shared/money/money.ts:93:7
   const intPart = dot === -1 ? unsigned : unsigned.slice(0, dot);
   const fracPart = dot === -1 ? '' : unsigned.slice(dot + 1);
 
-  if (fracPart.length > minorUnitDigits) {
+  if (false) {
     throw new TypeError(
       `too many fractional digits for ${minorUnitDigits}-minor-unit currency: ${value}`,
killedBy: money rejects excess fractional digits on parse
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: TypeError

Received function did not throw

[Survived] StringLiteral
src/shared/money/money.ts:95:7
 
   if (fracPart.length > minorUnitDigits) {
     throw new TypeError(
-      `too many fractional digits for ${minorUnitDigits}-minor-unit currency: ${value}`,
+      ``,
     );
   }

[Killed] ConditionalExpression
src/shared/money/money.ts:100:7
   }
 
   const significantInt = intPart.replace(/^0+/, '');
-  if (significantInt.length + fracPart.length > 19) {
+  if (false) {
     throw new TypeError(`too many significant digits: ${value}`);
   }
killedBy: money arithmetic and ordering rejects malformed and over-precise decimal strings
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: TypeError

Received function did not throw

[Killed] EqualityOperator
src/shared/money/money.ts:100:7
   }
 
   const significantInt = intPart.replace(/^0+/, '');
-  if (significantInt.length + fracPart.length > 19) {
+  if (significantInt.length + fracPart.length <= 19) {
     throw new TypeError(`too many significant digits: ${value}`);
   }
killedBy: money round trips one above Number.MAX_SAFE_INTEGER
statusReason: TypeError: too many significant digits: 90071992547409.93

[Survived] StringLiteral
src/shared/money/money.ts:101:25
 
   const significantInt = intPart.replace(/^0+/, '');
   if (significantInt.length + fracPart.length > 19) {
-    throw new TypeError(`too many significant digits: ${value}`);
+    throw new TypeError(``);
   }
 

[Killed] EqualityOperator
src/shared/money/money.ts:106:24
 
   const paddedFrac = fracPart.padEnd(minorUnitDigits, '0');
   const combined = intPart + paddedFrac;
-  const minor = BigInt(combined === '' ? '0' : combined);
+  const minor = BigInt(combined !== '' ? '0' : combined);
 
   return money(negative ? -minor : minor, code);
killedBy: money round trips one above Number.MAX_SAFE_INTEGER
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "currency": "USD",
-   "minor": 9007199254740993n,

[Killed] ConditionalExpression
src/shared/money/money.ts:106:24
 
   const paddedFrac = fracPart.padEnd(minorUnitDigits, '0');
   const combined = intPart + paddedFrac;
-  const minor = BigInt(combined === '' ? '0' : combined);
+  const minor = BigInt(true ? '0' : combined);
 
   return money(negative ? -minor : minor, code);
killedBy: money round trips one above Number.MAX_SAFE_INTEGER
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "currency": "USD",
-   "minor": 9007199254740993n,
