[Killed] BooleanLiteral
src/shared/result/result.ts:20:10
 }
 
 export function isErr<T, E>(r: Result<T, E>): r is Err<E> {
-  return !r.ok;
+  return r.ok;
 }
 
killedBy: result isOk(ok(1)) is true, isErr(ok(1)) is false, and the mirror
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
