[NoCoverage] BlockStatement
src/treasury/handlers/capacity-event.handler.ts:37:43
     }
 
     const inspected = await this.applyService.inspect(parsed.event);
-    if (inspected.kind === 'quarantined') {
-      return { kind: 'quarantined', reason: inspected.reason };
-    }
+    if (inspected.kind === 'quarantined') {}
     if (inspected.kind === 'already_applied') {
       return { kind: 'skipped' };

[NoCoverage] ConditionalExpression
src/treasury/handlers/capacity-event.handler.ts:40:9
     if (inspected.kind === 'quarantined') {
       return { kind: 'quarantined', reason: inspected.reason };
     }
-    if (inspected.kind === 'already_applied') {
+    if (false) {
       return { kind: 'skipped' };
     }

[NoCoverage] EqualityOperator
src/treasury/handlers/capacity-event.handler.ts:40:9
     if (inspected.kind === 'quarantined') {
       return { kind: 'quarantined', reason: inspected.reason };
     }
-    if (inspected.kind === 'already_applied') {
+    if (inspected.kind !== 'already_applied') {
       return { kind: 'skipped' };
     }

[NoCoverage] BlockStatement
src/treasury/handlers/capacity-event.handler.ts:49:41
       partition: message.partition,
       offset: message.offset,
     });
-    if (outcome.kind === 'quarantined') {
-      return { kind: 'quarantined', reason: outcome.reason };
-    }
+    if (outcome.kind === 'quarantined') {}
     if (outcome.kind === 'applied') {
       return { kind: 'applied' };

[NoCoverage] EqualityOperator
src/treasury/handlers/capacity-event.handler.ts:52:9
     if (outcome.kind === 'quarantined') {
       return { kind: 'quarantined', reason: outcome.reason };
     }
-    if (outcome.kind === 'applied') {
+    if (outcome.kind !== 'applied') {
       return { kind: 'applied' };
     }

[NoCoverage] ConditionalExpression
src/treasury/handlers/capacity-event.handler.ts:52:9
     if (outcome.kind === 'quarantined') {
       return { kind: 'quarantined', reason: outcome.reason };
     }
-    if (outcome.kind === 'applied') {
+    if (true) {
       return { kind: 'applied' };
     }
