[NoCoverage] BlockStatement
src/treasury/handlers/reconciliation-snapshot.handler.ts:36:43
     // Identity dedupe, then the staleness rule; stale snapshots are ignored
     // before the acknowledgement marker is even considered.
     const inspected = await this.applyService.inspect(snapshot);
-    if (inspected.kind === 'quarantined') {
-      return { kind: 'quarantined', reason: inspected.reason };
-    }
+    if (inspected.kind === 'quarantined') {}
     if (inspected.kind === 'ignored') {
       return { kind: 'skipped' };

[NoCoverage] BlockStatement
src/treasury/handlers/reconciliation-snapshot.handler.ts:39:39
     if (inspected.kind === 'quarantined') {
       return { kind: 'quarantined', reason: inspected.reason };
     }
-    if (inspected.kind === 'ignored') {
-      return { kind: 'skipped' };
-    }
+    if (inspected.kind === 'ignored') {}
 
     // FR-011b: without a marker the additive rule cannot be applied safely.

[NoCoverage] ConditionalExpression
src/treasury/handlers/reconciliation-snapshot.handler.ts:39:9
     if (inspected.kind === 'quarantined') {
       return { kind: 'quarantined', reason: inspected.reason };
     }
-    if (inspected.kind === 'ignored') {
+    if (false) {
       return { kind: 'skipped' };
     }

[NoCoverage] BlockStatement
src/treasury/handlers/reconciliation-snapshot.handler.ts:44:44
     }
 
     // FR-011b: without a marker the additive rule cannot be applied safely.
-    if (snapshot.acknowledgement === null) {
-      return { kind: 'quarantined', reason: 'MISSING_ACK_MARKER' };
-    }
+    if (snapshot.acknowledgement === null) {}
 
     const outcome = await this.applyService.apply(snapshot, {

[NoCoverage] EqualityOperator
src/treasury/handlers/reconciliation-snapshot.handler.ts:44:9
     }
 
     // FR-011b: without a marker the additive rule cannot be applied safely.
-    if (snapshot.acknowledgement === null) {
+    if (snapshot.acknowledgement !== null) {
       return { kind: 'quarantined', reason: 'MISSING_ACK_MARKER' };
     }

[NoCoverage] ConditionalExpression
src/treasury/handlers/reconciliation-snapshot.handler.ts:56:9
     if (outcome.kind === 'quarantined') {
       return { kind: 'quarantined', reason: outcome.reason };
     }
-    if (outcome.kind === 'applied') {
+    if (false) {
       return { kind: 'applied' };
     }
