[NoCoverage] StringLiteral
src/treasury/retry/failure-classifier.ts:12:25
 }
 
 export class PermanentTreasuryError extends Error {
-  constructor(message = 'permanent treasury failure') {
+  constructor(message = "") {
     super(message);
     this.name = 'PermanentTreasuryError';

[Killed] ArrayDeclaration
src/treasury/retry/failure-classifier.ts:34:65
 //   - 55 Object Not In Prerequisite State (all)
 //   - 57 Operator Intervention (all)
 //   - 58 System Error (all)
-const TRANSIENT_SQLSTATE_CLASSES: ReadonlySet<string> = new Set([
-  '08',
-  '53',
-  '55',
-  '57',
-  '58',
-]);
+const TRANSIENT_SQLSTATE_CLASSES: ReadonlySet<string> = new Set([]);
 
 // The two transaction-rollback codes that mean contention, not bad data.
killedBy: isTransientFailure reads a SQLSTATE code off a TypeORM QueryFailedError-style driverError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
src/treasury/retry/failure-classifier.ts:35:3
 //   - 57 Operator Intervention (all)
 //   - 58 System Error (all)
 const TRANSIENT_SQLSTATE_CLASSES: ReadonlySet<string> = new Set([
-  '08',
+  "",
   '53',
   '55',
killedBy: isTransientFailure covers the whole transient SQLSTATE classes by prefix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] StringLiteral
src/treasury/retry/failure-classifier.ts:43:72
 ]);
 
 // The two transaction-rollback codes that mean contention, not bad data.
-const TRANSIENT_CLASS40_CODES: ReadonlySet<string> = new Set(['40001', '40P01']);
+const TRANSIENT_CLASS40_CODES: ReadonlySet<string> = new Set(['40001', ""]);
 
 const TRANSIENT_SQLSTATE_CODES: ReadonlySet<string> = new Set([

[Survived] StringLiteral
src/treasury/retry/failure-classifier.ts:47:3
 
 const TRANSIENT_SQLSTATE_CODES: ReadonlySet<string> = new Set([
   '55P03',
-  '57014',
+  "",
   ...TRANSIENT_CLASS40_CODES,
 ]);

[Survived] StringLiteral
src/treasury/retry/failure-classifier.ts:55:3
   'ECONNREFUSED',
   'ECONNRESET',
   'ETIMEDOUT',
-  'ENOTFOUND',
+  "",
   'EPIPE',
   'EAI_AGAIN',

[Survived] Regex
src/treasury/retry/failure-classifier.ts:75:3
   /connection refused/i,
   /socket hang up/i,
   /terminating connection due to/i,
-  /connection to .* has been closed/i,
+  /connection to . has been closed/i,
   /connection pool/i,
   /too many clients/i,

[Killed] ConditionalExpression
src/treasury/retry/failure-classifier.ts:84:36
 ];
 
 function errorCode(error: unknown): string | undefined {
-  if (typeof error !== 'object' || error === null) {
+  if (typeof error !== 'object' || false) {
     return undefined;
   }
killedBy: classifyFailure classifies an unknown error shape as transient, never permanent
statusReason: TypeError: Cannot read properties of null (reading 'code')

[Killed] LogicalOperator
src/treasury/retry/failure-classifier.ts:84:7
 ];
 
 function errorCode(error: unknown): string | undefined {
-  if (typeof error !== 'object' || error === null) {
+  if (typeof error !== 'object' && error === null) {
     return undefined;
   }
killedBy: classifyFailure classifies an unknown error shape as transient, never permanent
statusReason: TypeError: Cannot read properties of null (reading 'code')

[Killed] BlockStatement
src/treasury/retry/failure-classifier.ts:89:35
   }
 
   const direct = (error as { code?: unknown }).code;
-  if (typeof direct === 'string') {
-    return direct;
-  }
+  if (typeof direct === 'string') {}
 
   // TypeORM wraps the underlying pg error in QueryFailedError without copying
killedBy: isTransientFailure covers the whole transient SQLSTATE classes by prefix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/treasury/retry/failure-classifier.ts:96:7
   // TypeORM wraps the underlying pg error in QueryFailedError without copying
   // its `code`; the driver error is what carries the SQLSTATE.
   const driverError = (error as { driverError?: unknown }).driverError;
-  if (typeof driverError === 'object' && driverError !== null) {
+  if (typeof driverError !== 'object' && driverError !== null) {
     const driverCode = (driverError as { code?: unknown }).code;
     if (typeof driverCode === 'string') {
killedBy: classifyFailure reads the code from a wrapped cause
statusReason: TypeError: Cannot read properties of undefined (reading 'code')

[Killed] BlockStatement
src/treasury/retry/failure-classifier.ts:96:64
   // TypeORM wraps the underlying pg error in QueryFailedError without copying
   // its `code`; the driver error is what carries the SQLSTATE.
   const driverError = (error as { driverError?: unknown }).driverError;
-  if (typeof driverError === 'object' && driverError !== null) {
-    const driverCode = (driverError as { code?: unknown }).code;
-    if (typeof driverCode === 'string') {
-      return driverCode;
-    }
-  }
+  if (typeof driverError === 'object' && driverError !== null) {}
 
   const cause = (error as { cause?: unknown }).cause;
killedBy: isTransientFailure reads a SQLSTATE code off a TypeORM QueryFailedError-style driverError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/treasury/retry/failure-classifier.ts:98:41
   const driverError = (error as { driverError?: unknown }).driverError;
   if (typeof driverError === 'object' && driverError !== null) {
     const driverCode = (driverError as { code?: unknown }).code;
-    if (typeof driverCode === 'string') {
-      return driverCode;
-    }
+    if (typeof driverCode === 'string') {}
   }
 
killedBy: isTransientFailure reads a SQLSTATE code off a TypeORM QueryFailedError-style driverError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/treasury/retry/failure-classifier.ts:104:7
   }
 
   const cause = (error as { cause?: unknown }).cause;
-  if (typeof cause === 'object' && cause !== null) {
+  if (typeof cause === 'object' || cause !== null) {
     const causeCode = (cause as { code?: unknown }).code;
     if (typeof causeCode === 'string') {
killedBy: TreasuryConsumer.processMessage correlation ids rethrows a code-less transient failure without DLQ publish or offset commit (FR-035)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/treasury/retry/failure-classifier.ts:104:7
   }
 
   const cause = (error as { cause?: unknown }).cause;
-  if (typeof cause === 'object' && cause !== null) {
+  if (true) {
     const causeCode = (cause as { code?: unknown }).code;
     if (typeof causeCode === 'string') {
killedBy: TreasuryConsumer.processMessage correlation ids rethrows a code-less transient failure without DLQ publish or offset commit (FR-035)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Survived] BlockStatement
src/treasury/retry/failure-classifier.ts:106:40
   const cause = (error as { cause?: unknown }).cause;
   if (typeof cause === 'object' && cause !== null) {
     const causeCode = (cause as { code?: unknown }).code;
-    if (typeof causeCode === 'string') {
-      return causeCode;
-    }
+    if (typeof causeCode === 'string') {}
   }
 

[Killed] BlockStatement
src/treasury/retry/failure-classifier.ts:115:52
 }
 
 function errorMessage(error: unknown): string | undefined {
-  if (typeof error !== 'object' || error === null) {
-    return undefined;
-  }
+  if (typeof error !== 'object' || error === null) {}
 
   const direct = (error as { message?: unknown }).message;
killedBy: classifyFailure classifies an unknown error shape as transient, never permanent
statusReason: TypeError: Cannot read properties of null (reading 'message')

[Killed] EqualityOperator
src/treasury/retry/failure-classifier.ts:115:7
 }
 
 function errorMessage(error: unknown): string | undefined {
-  if (typeof error !== 'object' || error === null) {
+  if (typeof error === 'object' || error === null) {
     return undefined;
   }
killedBy: TreasuryConsumer.processMessage correlation ids rethrows a code-less transient failure without DLQ publish or offset commit (FR-035)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/treasury/retry/failure-classifier.ts:120:35
   }
 
   const direct = (error as { message?: unknown }).message;
-  if (typeof direct === 'string') {
-    return direct;
-  }
+  if (typeof direct === 'string') {}
 
   const cause = (error as { cause?: unknown }).cause;
killedBy: isTransientFailure treats a code-less pg-pool connect timeout as transient by message
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/treasury/retry/failure-classifier.ts:125:7
   }
 
   const cause = (error as { cause?: unknown }).cause;
-  if (typeof cause === 'object' && cause !== null) {
+  if (typeof cause !== 'object' && cause !== null) {
     const causeMessage = (cause as { message?: unknown }).message;
     if (typeof causeMessage === 'string') {
killedBy: classifyFailure classifies an unknown error shape as transient, never permanent
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[NoCoverage] BlockStatement
src/treasury/retry/failure-classifier.ts:127:43
   const cause = (error as { cause?: unknown }).cause;
   if (typeof cause === 'object' && cause !== null) {
     const causeMessage = (cause as { message?: unknown }).message;
-    if (typeof causeMessage === 'string') {
-      return causeMessage;
-    }
+    if (typeof causeMessage === 'string') {}
   }
 

[Killed] ConditionalExpression
src/treasury/retry/failure-classifier.ts:136:7
 }
 
 export function classifyFailure(error: unknown): FailureClass {
-  if (error instanceof PermanentTreasuryError) {
+  if (true) {
     return 'PERMANENT';
   }
killedBy: classifyFailure classifies a Postgres SQLSTATE transient code as transient
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "TRANSIENT"
Received: "PERMANENT"

[Killed] ConditionalExpression
src/treasury/retry/failure-classifier.ts:136:7
 }
 
 export function classifyFailure(error: unknown): FailureClass {
-  if (error instanceof PermanentTreasuryError) {
+  if (false) {
     return 'PERMANENT';
   }
killedBy: classifyFailure classifies a PermanentTreasuryError as permanent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PERMANENT"
Received: "TRANSIENT"

[Survived] ConditionalExpression
src/treasury/retry/failure-classifier.ts:140:7
     return 'PERMANENT';
   }
 
-  if (isTransientFailure(error)) {
+  if (false) {
     return 'TRANSIENT';
   }

[Survived] ConditionalExpression
src/treasury/retry/failure-classifier.ts:140:7
     return 'PERMANENT';
   }
 
-  if (isTransientFailure(error)) {
+  if (true) {
     return 'TRANSIENT';
   }

[Killed] BlockStatement
src/treasury/retry/failure-classifier.ts:157:27
  */
 export function isTransientFailure(error: unknown): boolean {
   const code = errorCode(error);
-  if (code !== undefined) {
-    if (
-      TRANSIENT_SQLSTATE_CODES.has(code) ||
-      TRANSIENT_NETWORK_CODES.has(code)
-    ) {
-      return true;
-    }
-    const codeClass = code.slice(0, 2);
-    if (
-      code.length === 5 &&
-      TRANSIENT_SQLSTATE_CLASSES.has(codeClass)
-    ) {
-      return true;
-    }
-  }
+  if (code !== undefined) {}
 
   const message = errorMessage(error);
killedBy: isTransientFailure reads a SQLSTATE code off a TypeORM QueryFailedError-style driverError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ConditionalExpression
src/treasury/retry/failure-classifier.ts:159:7
   const code = errorCode(error);
   if (code !== undefined) {
     if (
-      TRANSIENT_SQLSTATE_CODES.has(code) ||
-      TRANSIENT_NETWORK_CODES.has(code)
+      false
     ) {
       return true;

[Survived] LogicalOperator
src/treasury/retry/failure-classifier.ts:159:7
   const code = errorCode(error);
   if (code !== undefined) {
     if (
-      TRANSIENT_SQLSTATE_CODES.has(code) ||
-      TRANSIENT_NETWORK_CODES.has(code)
+      TRANSIENT_SQLSTATE_CODES.has(code) && TRANSIENT_NETWORK_CODES.has(code)
     ) {
       return true;

[Survived] BlockStatement
src/treasury/retry/failure-classifier.ts:161:7
     if (
       TRANSIENT_SQLSTATE_CODES.has(code) ||
       TRANSIENT_NETWORK_CODES.has(code)
-    ) {
-      return true;
-    }
+    ) {}
     const codeClass = code.slice(0, 2);
     if (

[Killed] MethodExpression
src/treasury/retry/failure-classifier.ts:164:23
     ) {
       return true;
     }
-    const codeClass = code.slice(0, 2);
+    const codeClass = code;
     if (
       code.length === 5 &&
killedBy: isTransientFailure reads a SQLSTATE code off a TypeORM QueryFailedError-style driverError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/treasury/retry/failure-classifier.ts:166:7
     }
     const codeClass = code.slice(0, 2);
     if (
-      code.length === 5 &&
-      TRANSIENT_SQLSTATE_CLASSES.has(codeClass)
+      true
     ) {
       return true;
killedBy: isTransientFailure does not treat a non-contention transaction-rollback code as transient
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/treasury/retry/failure-classifier.ts:166:7
     }
     const codeClass = code.slice(0, 2);
     if (
-      code.length === 5 &&
+      code.length !== 5 &&
       TRANSIENT_SQLSTATE_CLASSES.has(codeClass)
     ) {
killedBy: isTransientFailure reads a SQLSTATE code off a TypeORM QueryFailedError-style driverError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/treasury/retry/failure-classifier.ts:168:7
     if (
       code.length === 5 &&
       TRANSIENT_SQLSTATE_CLASSES.has(codeClass)
-    ) {
-      return true;
-    }
+    ) {}
   }
 
killedBy: isTransientFailure reads a SQLSTATE code off a TypeORM QueryFailedError-style driverError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/treasury/retry/failure-classifier.ts:175:5
 
   const message = errorMessage(error);
   return (
-    message !== undefined &&
-    TRANSIENT_ERROR_MESSAGES.some((pattern) => pattern.test(message))
+    false
   );
 }
killedBy: TreasuryConsumer.processMessage correlation ids rethrows a code-less transient failure without DLQ publish or offset commit (FR-035)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/treasury/retry/failure-classifier.ts:175:5
 
   const message = errorMessage(error);
   return (
-    message !== undefined &&
-    TRANSIENT_ERROR_MESSAGES.some((pattern) => pattern.test(message))
+    true
   );
 }
killedBy: isTransientFailure is false for a code-less ordinary error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
src/treasury/retry/failure-classifier.ts:176:35
   const message = errorMessage(error);
   return (
     message !== undefined &&
-    TRANSIENT_ERROR_MESSAGES.some((pattern) => pattern.test(message))
+    TRANSIENT_ERROR_MESSAGES.some(() => undefined)
   );
 }
killedBy: TreasuryConsumer.processMessage correlation ids rethrows a code-less transient failure without DLQ publish or offset commit (FR-035)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] MethodExpression
src/treasury/retry/failure-classifier.ts:176:5
   const message = errorMessage(error);
   return (
     message !== undefined &&
-    TRANSIENT_ERROR_MESSAGES.some((pattern) => pattern.test(message))
+    TRANSIENT_ERROR_MESSAGES.every(pattern => pattern.test(message))
   );
 }
killedBy: TreasuryConsumer.processMessage correlation ids rethrows a code-less transient failure without DLQ publish or offset commit (FR-035)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Timeout] BlockStatement
src/treasury/retry/failure-classifier.ts:189:12
 ): Promise<T> {
   let attempt = 1;
 
-  for (;;) {
-    try {
-      return await fn();
-    } catch (error) {
-      if (classifyFailure(error) === 'PERMANENT') {
-        throw error;
-      }
-
-      if (attempt >= policy.maxAttempts) {
-        throw new RetryExhaustedError(error);
-      }
-
-      const delayMs = Math.min(
-        policy.maxDelayMs,
-        policy.baseDelayMs * 2 ** (attempt - 1),
-      );
-      onRetry?.(error, attempt, delayMs);
-      await sleep(delayMs);
-      attempt += 1;
-    }
-  }
+  for (;;) {}
 }
 

[Timeout] BlockStatement
src/treasury/retry/failure-classifier.ts:190:9
   let attempt = 1;
 
   for (;;) {
-    try {
-      return await fn();
-    } catch (error) {
+    try {} catch (error) {
       if (classifyFailure(error) === 'PERMANENT') {
         throw error;

[Timeout] BlockStatement
src/treasury/retry/failure-classifier.ts:192:21
   for (;;) {
     try {
       return await fn();
-    } catch (error) {
-      if (classifyFailure(error) === 'PERMANENT') {
-        throw error;
-      }
-
-      if (attempt >= policy.maxAttempts) {
-        throw new RetryExhaustedError(error);
-      }
-
-      const delayMs = Math.min(
-        policy.maxDelayMs,
-        policy.baseDelayMs * 2 ** (attempt - 1),
-      );
-      onRetry?.(error, attempt, delayMs);
-      await sleep(delayMs);
-      attempt += 1;
-    }
+    } catch (error) {}
   }
 }

[Killed] EqualityOperator
src/treasury/retry/failure-classifier.ts:193:11
     try {
       return await fn();
     } catch (error) {
-      if (classifyFailure(error) === 'PERMANENT') {
+      if (classifyFailure(error) !== 'PERMANENT') {
         throw error;
       }
killedBy: TreasuryConsumer.processMessage correlation ids rethrows a code-less transient failure without DLQ publish or offset commit (FR-035)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/treasury/retry/failure-classifier.ts:193:11
     try {
       return await fn();
     } catch (error) {
-      if (classifyFailure(error) === 'PERMANENT') {
+      if (false) {
         throw error;
       }
killedBy: withRetry rethrows a permanent error after one attempt
statusReason: Error: expect(received).rejects.toBeInstanceOf(expected)

Expected constructor: PermanentTreasuryError
Received constructor: RetryExhaustedError

[Killed] EqualityOperator
src/treasury/retry/failure-classifier.ts:197:11
         throw error;
       }
 
-      if (attempt >= policy.maxAttempts) {
+      if (attempt > policy.maxAttempts) {
         throw new RetryExhaustedError(error);
       }
killedBy: withRetry throws RetryExhaustedError once maxAttempts is reached
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 3

[Killed] EqualityOperator
src/treasury/retry/failure-classifier.ts:197:11
         throw error;
       }
 
-      if (attempt >= policy.maxAttempts) {
+      if (attempt < policy.maxAttempts) {
         throw new RetryExhaustedError(error);
       }
killedBy: withRetry retries a transient error in place and then succeeds
statusReason: Error: expect(received).resolves.toBe()

Received promise rejected instead of resolved
Rejected to value: [RetryExhaustedError: retry attempts exhausted]

[Timeout] CallExpression
src/treasury/retry/failure-classifier.ts:198:9
       }
 
       if (attempt >= policy.maxAttempts) {
-        throw new RetryExhaustedError(error);
+        ;
       }
 

[Survived] MethodExpression
src/treasury/retry/failure-classifier.ts:201:23
         throw new RetryExhaustedError(error);
       }
 
-      const delayMs = Math.min(
-        policy.maxDelayMs,
-        policy.baseDelayMs * 2 ** (attempt - 1),
-      );
+      const delayMs = Math.max(policy.maxDelayMs, policy.baseDelayMs * 2 ** (attempt - 1));
       onRetry?.(error, attempt, delayMs);
       await sleep(delayMs);

[Survived] ArithmeticOperator
src/treasury/retry/failure-classifier.ts:203:36
 
       const delayMs = Math.min(
         policy.maxDelayMs,
-        policy.baseDelayMs * 2 ** (attempt - 1),
+        policy.baseDelayMs * 2 ** (attempt + 1),
       );
       onRetry?.(error, attempt, delayMs);

[Survived] ArithmeticOperator
src/treasury/retry/failure-classifier.ts:203:9
 
       const delayMs = Math.min(
         policy.maxDelayMs,
-        policy.baseDelayMs * 2 ** (attempt - 1),
+        policy.baseDelayMs / 2 ** (attempt - 1),
       );
       onRetry?.(error, attempt, delayMs);

[Timeout] AssignmentOperator
src/treasury/retry/failure-classifier.ts:207:7
       );
       onRetry?.(error, attempt, delayMs);
       await sleep(delayMs);
-      attempt += 1;
+      attempt -= 1;
     }
   }
